tylertms/dspic33e-sim/conformance/processor.c
    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, 0x090011u);
    load_instruction(state, cpu, 0x202u, OPCODE_DIV_SD_W4_W3);
    cpu->w[3] = 0xffffu;
    cpu->w[4] = 0u;
    cpu->w[5] = 0x8000u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "initialize B1 signed double divide overflow");
    while (cpu->repeat_active != 0u) {
        expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
               "execute B1 signed double divide overflow");
    }
    expect(state, cpu->w[0] == 0u && cpu->w[1] == 0u && (cpu->sr & 0x000fu) == 0x0002u,
           "B1 signed double divide overflow leaves OV clear");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, 0x090011u);
    load_instruction(state, cpu, 0x202u, OPCODE_DIV_SD_W4_W3);
    cpu->w[3] = 1u;
    cpu->w[4] = 0x9c40u;
    cpu->w[5] = 0u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "initialize unaffected signed double divide overflow");
    while (cpu->repeat_active != 0u) {
        expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
               "execute unaffected signed double divide overflow");
    }
    expect(state, (cpu->sr & 0x0004u) != 0u,
           "unaffected signed double divide overflow sets OV");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x00000cu, 0x000300u);
    load_instruction(state, cpu, 0x000300u, OPCODE_RETFIE);
    load_instruction(state, cpu, 0x200u, 0x090011u);
    load_instruction(state, cpu, 0x202u, OPCODE_DIV_SW_W2_W3);
    cpu->w[2] = 42u;
    cpu->w[3] = 0u;
    cpu->w[15] = 0x5000u;
    cpu->stop_on_trap = false;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "initialize recursive math repeat");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "latch recursive math source");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x000300u &&
               cpu->trap_count == 1u && cpu->rcount == 15u,
           "enter first repeated divide math trap");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x000300u &&
               cpu->trap_count == 2u && cpu->last_trap_return == 0x202u &&
               cpu->rcount == 15u && cpu->w[15] == 0x5004u && cpu->cycles == 8u,
           "uncleared MATHERR re-enters before repeated instruction");
    dspic33_write_word(cpu, 0x08c0u, 0x0040u);
    expect(state,
           dspic33_read_word(cpu, 0x08c0u) == 0x0040u && pending_trap(cpu, 4u) == NULL,
           "clearing MATHERR preserves cause and clears level source");
    dspic33_write_word(cpu, 0x08c0u, 0u);
    expect(state, dspic33_read_word(cpu, 0x08c0u) == 0u,
           "software clears independent DIV0ERR cause");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x202u &&
               cpu->repeat_active != 0u && cpu->repeat_pc == 0x202u &&
               cpu->rcount == 15u && (cpu->sr & 0x0010u) != 0u && cpu->cycles == 14u,
           "RETFIE restores suspended repeat state");

    dspic33_write_word(cpu, 0x08c0u, 0x0010u);
    expect(state,
           dspic33_read_word(cpu, 0x08c0u) == 0x0010u && pending_trap(cpu, 4u) == NULL,
           "software MATHERR stores status without creating a trap source");
    dspic33_write_word(cpu, 0x08c0u, 0u);
    expect(state,
           dspic33_read_word(cpu, 0x08c0u) == 0u && pending_trap(cpu, 4u) == NULL,
           "software MATHERR clear cancels pending level source");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, 0x090010u);
    load_instruction(state, cpu, 0x202u, OPCODE_DIV_SW_W2_W3);
    cpu->w[2] = 42u;
    cpu->w[3] = 0u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "initialize short repeated divide");
    while (cpu->repeat_active != 0u) {
        expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
               "execute short repeated divide cycle");
    }
    expect(state, dspic33_read_word(cpu, 0x08c0u) == 0u && cpu->trap_count == 0u,
           "repeat count below seventeen does not latch DIV0");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, 0x090012u);
    load_instruction(state, cpu, 0x202u, OPCODE_DIV_SW_W2_W3);
    load_instruction(state, cpu, 0x00000cu, 0x000320u);
    cpu->w[2] = 42u;
    cpu->w[3] = 0u;
    cpu->w[15] = 0x5000u;
    cpu->stop_on_trap = true;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "initialize long repeated divide");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->rcount == 17u,
           "leading nonstandard divide iteration completes without trap");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->rcount == 16u,
           "RCOUNT seventeen latches delayed DIV0");
    expect(state,
           dspic33_step(cpu) == DSPIC33_TRAPPED && cpu->rcount == 15u &&
               cpu->last_trap_return == 0x202u,
           "nonstandard long repeat enters delayed DIV0 at proven stage");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_REPEAT_2);
    load_instruction(state, cpu, 0x202u, OPCODE_NOP);
    load_instruction(state, cpu, 0x000014u, 0x000300u);
    load_instruction(state, cpu, 0x000300u, OPCODE_NOP);
    load_instruction(state, cpu, 0x000302u, OPCODE_RETFIE);
    cpu->w[15] = 0x5000u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "initialize interruptible repeat");
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x000302u &&
               cpu->repeat_active == 0u && cpu->rcount == 2u &&
               (cpu->sr & 0x0010u) == 0u &&
               (dspic33_read_word(cpu, 0x5002u) & 0x1000u) != 0u,
           "interrupt entry suspends repeat and stacks RA");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x202u &&
               cpu->repeat_active != 0u && cpu->repeat_pc == 0x202u &&
               cpu->rcount == 2u && (cpu->sr & 0x0010u) != 0u,
           "interrupt RETFIE restores repeat state");
}

static void repeat_interrupt_cases(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_DISI_2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W1_IFS1);
    load_instruction(state, cpu, 0x204u, OPCODE_REPEAT_2);
    load_instruction(state, cpu, 0x206u, OPCODE_INCREMENT_W2);
    load_instruction(state, cpu, 0x00003cu, 0x000300u);
    load_instruction(state, cpu, 0x000300u, OPCODE_NOP);
    load_instruction(state, cpu, 0x000302u, OPCODE_RETFIE);
    cpu->w[1] = 0x0010u;
    cpu->w[15] = 0x5000u;
    dspic33_write_word(cpu, 0x0822u, 0x0010u);
    dspic33_write_word(cpu, 0x084au, 0x0004u);
    dspic33_write_word(cpu, 0x08c2u, 0x8000u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->disicnt == 2u &&
               cpu->cycles == 1u,
           "DISI initializes integrated repeat interrupt window");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->disicnt == 1u &&
               cpu->cycles == 2u && (dspic33_read_word(cpu, 0x0802u) & 0x0010u) != 0u,
           "word IFS write consumes one disabled cycle");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->disicnt == 0u &&
               cpu->repeat_active != 0u && cpu->repeat_pc == 0x206u &&
               cpu->rcount == 2u && cpu->cycles == 3u,
           "REPEAT consumes final disabled cycle");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x000302u &&
               cpu->last_interrupt == 20u && cpu->w[15] == 0x5004u &&
               dspic33_read_word(cpu, 0x5000u) == 0x206u &&
               (dspic33_read_word(cpu, 0x5002u) & 0x1000u) != 0u &&
               cpu->repeat_active == 0u && cpu->rcount == 2u &&
               (cpu->sr & 0x00f0u) == 0x0080u && cpu->cycles == 12u,
           "integrated interrupt suspends repeat at target");
    dspic33_write_word(cpu, 0x0802u, 0u);
    dspic33_write_word(cpu, 0x0822u, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x206u &&
               cpu->w[15] == 0x5000u && cpu->repeat_active != 0u &&
               cpu->repeat_pc == 0x206u && cpu->rcount == 2u &&
               (cpu->sr & 0x0010u) != 0u && cpu->cycles == 18u,
           "integrated RETFIE restores repeat state in six cycles");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[2] == 1u &&
               cpu->rcount == 1u && cpu->pc == 0x206u && cpu->cycles == 19u,
           "restored repeat executes first target");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[2] == 2u &&
               cpu->rcount == 0u && cpu->pc == 0x206u && cpu->cycles == 20u,
           "restored repeat executes second target");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[2] == 3u &&
               cpu->repeat_active == 0u && cpu->pc == 0x208u &&
               (cpu->sr & 0x0010u) == 0u && cpu->cycles == 21u,
           "restored repeat completes all targets");

