tylertms/dspic33e-sim/conformance/processor.c
    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_DISI_2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W1_IFS1);
    load_instruction(state, cpu, 0x204u, OPCODE_REPEAT_2);
    load_instruction(state, cpu, 0x206u, OPCODE_INCREMENT_W2);
    load_instruction(state, cpu, 0x00003cu, 0x000300u);
    load_instruction(state, cpu, 0x000300u, OPCODE_NOP);
    load_instruction(state, cpu, 0x000302u, OPCODE_CLEAR_RCOUNT);
    load_instruction(state, cpu, 0x000304u, OPCODE_RETFIE);
    cpu->w[1] = 0x0010u;
    cpu->w[15] = 0x5000u;
    dspic33_write_word(cpu, 0x0822u, 0x0010u);
    dspic33_write_word(cpu, 0x084au, 0x0004u);
    dspic33_write_word(cpu, 0x08c2u, 0x8000u);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "initialize early-termination interrupt window");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "raise early-termination interrupt with word write");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "arm repeat before early-termination interrupt");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x000302u &&
               cpu->w[15] == 0x5004u && cpu->rcount == 2u && cpu->repeat_active == 0u &&
               (cpu->sr & 0x00f0u) == 0x0080u && cpu->cycles == 12u,
           "early-termination handler observes suspended repeat");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x000304u &&
               cpu->rcount == 0u && cpu->cycles == 13u,
           "handler clears suspended RCOUNT");
    dspic33_write_word(cpu, 0x0802u, 0u);
    dspic33_write_word(cpu, 0x0822u, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x206u &&
               cpu->w[15] == 0x5000u && cpu->repeat_active != 0u &&
               cpu->repeat_pc == 0x206u && cpu->rcount == 0u &&
               (cpu->sr & 0x0010u) != 0u && cpu->cycles == 19u,
           "RETFIE restores prefetched target after RCOUNT clear");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[2] == 1u &&
               cpu->pc == 0x208u && cpu->rcount == 0u && cpu->repeat_active == 0u &&
               (cpu->sr & 0x0010u) == 0u && cpu->cycles == 20u,
           "cleared repeat executes final prefetched target once");
}

static void prepare_nested_do_interrupt_case(ProcessorConformance* state, Dspic33* cpu,
                                             uint32_t entry, bool nesting_disabled) {
    uint32_t address;
    reset_processor_conformance(cpu, entry);
    for (address = 0x204u; address <= 0x208u; address += 2u) {
        load_instruction(state, cpu, address, OPCODE_NOP);
    }
    load_instruction(state, cpu, 0x0014u, 0x000300u);
    load_instruction(state, cpu, 0x0016u, 0x000320u);
    for (address = 0x300u; address <= 0x30au; address += 2u) {
        load_instruction(state, cpu, address, OPCODE_NOP);
    }
    load_instruction(state, cpu, 0x30cu, OPCODE_RETFIE);
    load_instruction(state, cpu, 0x320u, OPCODE_NOP);
    load_instruction(state, cpu, 0x322u, OPCODE_RETFIE);
    cpu->w[15] = 0x5000u;
    cpu->do_depth = 1u;
    cpu->do_start[0] = 0x204u;
    cpu->do_end[0] = 0x208u;
    cpu->do_count[0] = 3u;
    cpu->dostart = 0x204u;
    cpu->doend = 0x208u;
    cpu->dcount = 3u;
    cpu->sr |= 0x0200u;
    cpu->corcon = (uint16_t)((cpu->corcon & ~0x0700u) | 0x0100u);
    dspic33_write_word(cpu, 0x08c0u, nesting_disabled ? 0x8000u : 0u);
    dspic33_write_word(cpu, 0x0820u, 0x0003u);
    dspic33_write_word(cpu, 0x0840u, 0x0042u);
    dspic33_write_word(cpu, 0x08c2u, 0x8000u);
}

static void complete_first_nested_do_interrupt_entry(ProcessorConformance* state,
                                                     Dspic33* cpu, bool expected_armed,
                                                     bool expected_extra_decrement) {
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x302u &&
               cpu->cycles == 10u && cpu->interrupt_depth == 1u &&
               (cpu->nested_do_extra_decrement_depth != 0u) ==
                   expected_extra_decrement &&
               cpu->nested_do_interrupt_armed == expected_armed,
           "first DO-loop interrupt entry evaluates nested request timing");
    dspic33_write_word(cpu, 0x0800u, (uint16_t)(dspic33_read_word(cpu, 0x0800u) & ~1u));
}

static void enter_first_nested_do_interrupt(ProcessorConformance* state, Dspic33* cpu,
                                            bool expected_armed, uint8_t nested_delay,
                                            bool expected_extra_decrement) {
    dspic33_raise_interrupt(cpu, 0u);
    expect(state, cpu->nested_do_interrupt_armed == expected_armed,
           "first DO-loop interrupt request records the erratum window");
    if (nested_delay != 0u) {
        expect(state,
               dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 1u, 0u, nested_delay),
               "schedule higher-priority request inside interrupt entry");
    }
    complete_first_nested_do_interrupt_entry(
        state, cpu, expected_armed && nested_delay == 0u, expected_extra_decrement);
}

static void complete_nested_do_interrupt_case(ProcessorConformance* state, Dspic33* cpu,
                                              bool expected_extra_decrement) {
    uint8_t index;
    uint8_t main_steps;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x322u &&
               cpu->interrupt_depth == 2u &&
               (cpu->nested_do_extra_decrement_depth != 0u) == expected_extra_decrement,
           "higher-priority nested interrupt evaluates the exact four-cycle window");
    dspic33_write_word(cpu, 0x0800u, 0u);
    dspic33_write_word(cpu, 0x0820u, 0u);
    for (index = 0u; cpu->interrupt_depth != 0u && index < 8u; index++) {
        expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
               "nested DO-loop interrupt handlers return normally");
    }
    expect(state, cpu->interrupt_depth == 0u,
           "nested DO-loop interrupt stack fully unwinds");
    main_steps = (uint8_t)(((0x208u - cpu->pc) / 2u) + 1u);
    for (index = 0u; index < main_steps; index++) {
        expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
               "interrupted DO-loop reaches its iteration boundary");
    }
    expect(state,
           cpu->pc == 0x204u && cpu->do_depth == 1u &&
               cpu->dcount == (expected_extra_decrement ? 1u : 2u) &&
               cpu->do_count[0] == cpu->dcount &&
               cpu->nested_do_extra_decrement_depth == 0u &&
               cpu->nested_do_extra_decrement_end == 0u &&
               !cpu->nested_do_interrupt_armed,
           "DO-loop iteration applies only the documented nested decrement");
}

static void nested_do_interrupt_erratum_cases(ProcessorConformance* state,
                                              Dspic33* cpu) {
    static const uint32_t entries[] = {0x206u, 0x208u};
    static const uint8_t delays[] = {3u, 4u, 5u};
    static const uint16_t divisors[] = {0x1800u, 0x9800u};
    static const uint8_t divided_deadlines[] = {10u, 6u};
    Dspic33 copy;
    size_t entry_index;
    size_t delay_index;
    size_t divisor_index;

