tylertms/dspic33e-sim/conformance/processor.c
    prepare_nested_do_interrupt_case(state, cpu, 0x206u, false);
    dspic33_raise_interrupt(cpu, 0u);
    expect(state, cpu->nested_do_interrupt_armed,
           "copy source records the first DO-loop interrupt request");
    expect(state, dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 1u, 0u, 4u),
           "copy source schedules the exact nested request");
    expect(state, dspic33_initialize(&copy), "initialize nested DO-loop erratum copy");
    expect(state, dspic33_copy(&copy, cpu), "copy armed nested DO-loop erratum state");
    complete_first_nested_do_interrupt_entry(state, cpu, false, true);
    complete_first_nested_do_interrupt_entry(state, &copy, false, true);
    complete_nested_do_interrupt_case(state, cpu, true);
    complete_nested_do_interrupt_case(state, &copy, true);
    dspic33_destroy(&copy);

    prepare_nested_do_interrupt_case(state, cpu, 0x208u, false);
    enter_first_nested_do_interrupt(state, cpu, true, 0u, false);
    load_instruction(state, cpu, 0x302u, OPCODE_RESET);
    dspic33_write_word(cpu, 0x0800u, 0u);
    dspic33_write_word(cpu, 0x0820u, 0u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->software_reset_count == 1u &&
               !cpu->nested_do_interrupt_armed &&
               cpu->nested_do_interrupt_cycle == 0u &&
               cpu->nested_do_interrupt_end == 0u &&
               cpu->nested_do_interrupt_depth == 0u &&
               cpu->nested_do_interrupt_priority == 0u &&
               cpu->nested_do_extra_decrement_depth == 0u &&
               cpu->nested_do_extra_decrement_end == 0u,
           "warm reset clears nested DO-loop erratum state");
}

static void call_stack_timing_case(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    cpu->stop_on_trap = true;
    load_instruction(state, cpu, 0x00000au, 0x000200u);
    load_instruction(state, cpu, 0u, OPCODE_CALL_0X300);
    load_instruction(state, cpu, 2u, OPCODE_NOP);
    load_instruction(state, cpu, 0x000300u, OPCODE_MOV_SENTINEL_W1);
    dspic33_write_word(cpu, 0x0020u, 0x4ffeu);
    cpu->w[15] = 0x5000u;
    expect(state, dspic33_step(cpu) == DSPIC33_TRAPPED,
           "CALL stack fault matures within CALL cycles");
    expect(state, cpu->w[1] == 0u, "CALL stack fault precedes target instruction");
    expect(state, cpu->last_trap == 3u && cpu->pc == 0x000200u,
           "CALL stack fault enters stack trap");
    expect(state, cpu->w[15] == 0x5008u && dspic33_read_word(cpu, 0x5004u) == 0x0300u,
           "CALL stack fault stacks target return PC");
}

static void instruction_cycle_cases(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_NOP);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 1u,
           "NOP consumes one cycle");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_DOUBLE_W14_W2);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 2u,
           "MOV.D consumes two cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_CALL_0X300);
    load_instruction(state, cpu, 2u, OPCODE_NOP);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 4u,
           "direct CALL consumes four cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_CALL_W0);
    cpu->w[0] = 0x0300u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 4u,
           "CALL Wn consumes four cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_RCALL_NEXT);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 4u,
           "literal RCALL consumes four cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_RCALL_W0);
    cpu->w[0] = 0x007fu;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 4u,
           "RCALL Wn consumes four cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_CALL_LONG_W0);
    cpu->w[0] = 0x0300u;
    cpu->w[1] = 0u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 4u,
           "CALL.L consumes four cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_RETFIE);
    load_instruction(state, cpu, 0x000300u, OPCODE_NOP);
    dspic33_write_word(cpu, 0x5000u, 0x0300u);
    dspic33_write_word(cpu, 0x5002u, 0u);
    cpu->w[15] = 0x5004u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 6u,
           "RETFIE without pending exception consumes six cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_RETFIE);
    load_instruction(state, cpu, 0x000300u, OPCODE_NOP);
    load_instruction(state, cpu, 0x000014u, 0x000200u);
    dspic33_write_word(cpu, 0x5000u, 0x0300u);
    dspic33_write_word(cpu, 0x5002u, 0u);
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    cpu->sr = 0x00e0u;
    cpu->w[15] = 0x5004u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 5u,
           "RETFIE with pending exception consumes five cycles");
}

static void register_move_instruction_cases(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_SWAP_W1);
    cpu->initialized_working_registers &= (uint16_t)~0x0002u;
    cpu->w[1] = 0xa587u;
    cpu->sr = 0x0105u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[1] == 0x87a5u &&
               cpu->sr == 0x0105u && cpu->cycles == 1u &&
               (cpu->initialized_working_registers & 0x0002u) != 0u,
           "SWAP exchanges bytes and initializes word destination");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_SWAP_BYTE_W1);
    cpu->initialized_working_registers &= (uint16_t)~0x0002u;
    cpu->w[1] = 0xa587u;
    cpu->sr = 0x0105u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[1] == 0xa578u &&
               cpu->sr == 0x0105u && cpu->cycles == 1u &&
               (cpu->initialized_working_registers & 0x0002u) == 0u,
           "SWAP.B exchanges low nibbles without initializing byte destination");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_SWAP_W15);
    cpu->w[15] = 0xa586u;
    cpu->sr = 0x0105u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[15] == 0x86a4u &&
               cpu->sr == 0x0105u && cpu->cycles == 1u,
           "SWAP keeps stack pointer even");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_SWAP_BYTE_W15);
    cpu->w[15] = 0xa586u;
    cpu->sr = 0x0105u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[15] == 0xa568u &&
               cpu->sr == 0x0105u && cpu->cycles == 1u,
           "SWAP.B keeps stack pointer even");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_EXCH_W1_W2);
    cpu->initialized_working_registers &= (uint16_t)~0x0006u;
    cpu->w[1] = 0x1234u;
    cpu->w[2] = 0xa5a5u;
    cpu->sr = 0x0105u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[1] == 0xa5a5u &&
               cpu->w[2] == 0x1234u && cpu->sr == 0x0105u && cpu->cycles == 1u &&
               (cpu->initialized_working_registers & 0x0006u) == 0x0006u,
           "EXCH swaps registers and initializes both destinations");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_EXCH_W1_W1);
    cpu->initialized_working_registers &= (uint16_t)~0x0002u;
    cpu->w[1] = 0xa5a5u;
    cpu->sr = 0x0105u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[1] == 0xa5a5u &&
               cpu->sr == 0x0105u && cpu->cycles == 1u &&
               (cpu->initialized_working_registers & 0x0002u) != 0u,
           "EXCH accepts identical source and destination");
}

static void direct_file_move_cases(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_FILE_WORD_0X1000);
    dspic33_write_word(cpu, 0x1000u, 0x8000u);
    cpu->w[0] = 0x5a5au;
    cpu->sr = 0x0107u;
    cpu->io.cpu_write_valid = false;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, 0x1000u) == 0x8000u && cpu->w[0] == 0x5a5au &&
               cpu->sr == 0x010du && cpu->cycles == 1u && cpu->io.cpu_write_valid &&
               cpu->io.cpu_write_address == 0x1000u && cpu->io.cpu_write_width == 2u &&
               cpu->io.cpu_write_previous == 0x8000u,
           "word file destination writes back RAM before updating flags");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_FILE_BYTE_0X1001);
    dspic33_write_word(cpu, 0x1000u, 0x8000u);
    cpu->w[0] = 0x5a5au;
    cpu->sr = 0x0107u;
    cpu->io.cpu_write_valid = false;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, 0x1000u) == 0x8000u && cpu->w[0] == 0x5a5au &&
               cpu->sr == 0x010du && cpu->cycles == 1u && cpu->io.cpu_write_valid &&
               cpu->io.cpu_write_address == 0x1001u && cpu->io.cpu_write_width == 1u &&
               cpu->io.cpu_write_previous == 0x0080u,
           "byte file destination writes back RAM before updating flags");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_FILE_WORD_W0);
    cpu->w[0] = 0u;
    cpu->initialized_working_registers &= (uint16_t)~0x0001u;
    cpu->sr = 0x010du;
    cpu->io.cpu_write_valid = false;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[0] == 0u &&
               cpu->sr == 0x0107u && cpu->cycles == 1u &&
               (cpu->initialized_working_registers & 0x0001u) != 0u &&
               cpu->io.cpu_write_valid && cpu->io.cpu_write_address == 0u &&
               cpu->io.cpu_write_width == 2u,
           "word file destination initializes working-register alias");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_FILE_BYTE_W0);
    cpu->w[0] = 0x0080u;
    cpu->initialized_working_registers &= (uint16_t)~0x0001u;
    cpu->sr = 0x0107u;
    cpu->io.cpu_write_valid = false;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[0] == 0x0080u &&
               cpu->sr == 0x010du && cpu->cycles == 1u &&
               (cpu->initialized_working_registers & 0x0001u) == 0u &&
               cpu->io.cpu_write_valid && cpu->io.cpu_write_address == 0u &&
               cpu->io.cpu_write_width == 1u,
           "byte file destination preserves uninitialized working-register alias");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_0X1000_WREG);
    dspic33_write_word(cpu, 0x1000u, 0x8000u);
    cpu->sr = 0x0107u;
    cpu->io.cpu_write_valid = false;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[0] == 0x8000u &&
               cpu->sr == 0x010du && cpu->cycles == 1u && !cpu->io.cpu_write_valid,
           "word WREG destination does not write back source file");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_BYTE_0X1001_WREG);
    dspic33_write_word(cpu, 0x1000u, 0x8000u);
    cpu->w[0] = 0x5a5au;
    cpu->sr = 0x0107u;
    cpu->io.cpu_write_valid = false;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[0] == 0x5a80u &&
               cpu->sr == 0x010du && cpu->cycles == 1u && !cpu->io.cpu_write_valid,
           "byte WREG destination does not write back source file");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_FILE_WORD_CORCON);
    cpu->sr = 0x010du;
    cpu->io.cpu_write_valid = false;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->corcon == 0x0020u &&
               cpu->sr == 0x0105u && cpu->cycles == 1u && cpu->io.cpu_write_valid,
           "CPU SFR file destination writes back in one cycle");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_FILE_WORD_PORTB);
    dspic33_gpio_input(cpu, 1u, 0u);
    dspic33_write_word(cpu, 0x0e10u, 0xffffu);
    dspic33_write_word(cpu, 0x0e14u, 0xffffu);
    dspic33_write_word(cpu, 0x0e1eu, 0u);
    cpu->w[0] = 0x5a5au;
    cpu->sr = 0x010du;
    cpu->io.cpu_write_valid = false;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, 0x0e14u) == 0u && cpu->w[0] == 0x5a5au &&
               cpu->sr == 0x0107u && cpu->cycles == 2u && cpu->io.cpu_write_valid &&
               cpu->io.cpu_write_address == 0x0e12u && cpu->io.cpu_write_width == 2u,
           "non-CPU SFR word file destination writes pins back to latch");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_FILE_BYTE_PORTB);
    dspic33_gpio_input(cpu, 1u, 0u);
    dspic33_write_word(cpu, 0x0e10u, 0xffffu);
    dspic33_write_word(cpu, 0x0e14u, 0xffffu);
    dspic33_write_word(cpu, 0x0e1eu, 0u);
    cpu->w[0] = 0x5a5au;
    cpu->sr = 0x010du;
    cpu->io.cpu_write_valid = false;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, 0x0e14u) == 0u && cpu->w[0] == 0x5a5au &&
               cpu->sr == 0x0107u && cpu->cycles == 2u && cpu->io.cpu_write_valid &&
               cpu->io.cpu_write_address == 0x0e12u && cpu->io.cpu_write_width == 1u,
           "non-CPU SFR byte file destination writes pins back to latch");
}

static void move_double_mode_cases(ProcessorConformance* state, Dspic33* cpu) {
    static const struct {
        uint32_t opcode;
        uint16_t initial_pointer;
        uint16_t access_address;
        uint16_t final_pointer;
        uint16_t low;
        uint16_t high;
        const char* name;
    } source_cases[] = {
        {OPCODE_MOV_DOUBLE_W4_POST_DECREMENT_W2, 0x5004u, 0x5004u, 0x5000u, 0x1112u,
         0x2212u, "MOV.D source post-decrement"},
        {OPCODE_MOV_DOUBLE_W4_POST_INCREMENT_W2, 0x5000u, 0x5000u, 0x5004u, 0x1113u,
         0x2213u, "MOV.D source post-increment"},
        {OPCODE_MOV_DOUBLE_W4_PRE_DECREMENT_W2, 0x5004u, 0x5000u, 0x5000u, 0x1114u,
         0x2214u, "MOV.D source pre-decrement"},
        {OPCODE_MOV_DOUBLE_W4_PRE_INCREMENT_W2, 0x4ffcu, 0x5000u, 0x5000u, 0x1115u,
         0x2215u, "MOV.D source pre-increment"},
    };
    static const struct {
        uint32_t opcode;
        uint16_t initial_pointer;
        uint16_t access_address;
        uint16_t final_pointer;
        uint16_t preserved_address;
        uint16_t low;
        uint16_t high;
        const char* name;
    } destination_cases[] = {
        {OPCODE_MOV_DOUBLE_W2_W4_POST_DECREMENT, 0x5004u, 0x5004u, 0x5000u, 0x5000u,
         0x3312u, 0x4412u, "MOV.D destination post-decrement"},
        {OPCODE_MOV_DOUBLE_W2_W4_POST_INCREMENT, 0x5000u, 0x5000u, 0x5004u, 0x5004u,
         0x3313u, 0x4413u, "MOV.D destination post-increment"},
        {OPCODE_MOV_DOUBLE_W2_W4_PRE_DECREMENT, 0x5004u, 0x5000u, 0x5000u, 0x5004u,
         0x3314u, 0x4414u, "MOV.D destination pre-decrement"},
        {OPCODE_MOV_DOUBLE_W2_W4_PRE_INCREMENT, 0x4ffcu, 0x5000u, 0x5000u, 0x4ffcu,
         0x3315u, 0x4415u, "MOV.D destination pre-increment"},
    };
    size_t index;

    for (index = 0u; index < sizeof(source_cases) / sizeof(source_cases[0]); index++) {
        reset_processor_conformance(cpu, 0u);
        load_instruction(state, cpu, 0u, source_cases[index].opcode);
        dspic33_write_word(cpu, 0x4ffcu, 0xdeadu);
        dspic33_write_word(cpu, 0x4ffeu, 0xdeadu);
        dspic33_write_word(cpu, 0x5000u, 0xdeadu);
        dspic33_write_word(cpu, 0x5002u, 0xdeadu);
        dspic33_write_word(cpu, 0x5004u, 0xdeadu);
        dspic33_write_word(cpu, 0x5006u, 0xdeadu);
        dspic33_write_word(cpu, source_cases[index].access_address,
                           source_cases[index].low);
        dspic33_write_word(cpu, source_cases[index].access_address + 2u,
                           source_cases[index].high);
        dspic33_set_working_register(cpu, 4u, source_cases[index].initial_pointer);
        cpu->sr = 0x010fu;
        expect(state,
               dspic33_step(cpu) == DSPIC33_RUNNING &&
                   cpu->w[2] == source_cases[index].low &&
                   cpu->w[3] == source_cases[index].high &&
                   cpu->w[4] == source_cases[index].final_pointer &&
                   cpu->sr == 0x010fu && cpu->cycles == 2u,
               source_cases[index].name);
    }

    for (index = 0u; index < sizeof(destination_cases) / sizeof(destination_cases[0]);
         index++) {
        reset_processor_conformance(cpu, 0u);
        load_instruction(state, cpu, 0u, destination_cases[index].opcode);
        dspic33_write_word(cpu, 0x4ffcu, 0xdeadu);
        dspic33_write_word(cpu, 0x4ffeu, 0xdeadu);
        dspic33_write_word(cpu, 0x5000u, 0xdeadu);
        dspic33_write_word(cpu, 0x5002u, 0xdeadu);
        dspic33_write_word(cpu, 0x5004u, 0xdeadu);
        dspic33_write_word(cpu, 0x5006u, 0xdeadu);
        dspic33_set_working_register(cpu, 2u, destination_cases[index].low);
        dspic33_set_working_register(cpu, 3u, destination_cases[index].high);
        dspic33_set_working_register(cpu, 4u, destination_cases[index].initial_pointer);
        cpu->sr = 0x010fu;
        expect(state,
               dspic33_step(cpu) == DSPIC33_RUNNING &&
                   dspic33_read_word(cpu, destination_cases[index].access_address) ==
                       destination_cases[index].low &&
                   dspic33_read_word(cpu, destination_cases[index].access_address +
                                              2u) == destination_cases[index].high &&
                   dspic33_read_word(cpu, destination_cases[index].preserved_address) ==
                       0xdeadu &&
                   cpu->w[4] == destination_cases[index].final_pointer &&
                   cpu->sr == 0x010fu && cpu->cycles == 2u,
               destination_cases[index].name);
    }

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_DOUBLE_W2_POST_INCREMENT_W2);
    dspic33_write_word(cpu, 0x5000u, 0x5511u);
    dspic33_write_word(cpu, 0x5002u, 0x6622u);
    dspic33_set_working_register(cpu, 2u, 0x5000u);
    cpu->sr = 0x010fu;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[2] == 0x5511u &&
               cpu->w[3] == 0x6622u && cpu->sr == 0x010fu && cpu->cycles == 2u,
           "MOV.D overlapping load writes destination after source pointer update");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_DOUBLE_W2_W2_POST_INCREMENT);
    dspic33_write_word(cpu, 0x5000u, 0xdeadu);
    dspic33_write_word(cpu, 0x5002u, 0xdeadu);
    dspic33_set_working_register(cpu, 2u, 0x5000u);
    dspic33_set_working_register(cpu, 3u, 0x7788u);
    cpu->sr = 0x010fu;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[2] == 0x5004u &&
               cpu->w[3] == 0x7788u && dspic33_read_word(cpu, 0x5000u) == 0x5000u &&
               dspic33_read_word(cpu, 0x5002u) == 0x7788u && cpu->sr == 0x010fu &&
               cpu->cycles == 2u,
           "MOV.D overlapping store captures source before destination pointer update");
}

static void non_cpu_sfr_timing_cases(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_BSET_BYTE_IFS0_BIT_0);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 2u &&
               (dspic33_read_word(cpu, 0x0800u) & 1u) != 0u,
           "non-CPU SFR bit RMW consumes two cycles");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_BSET_BYTE_IFS0_BIT_0);
    load_instruction(state, cpu, 2u, OPCODE_NOP);
    load_instruction(state, cpu, 0x0014u, 0x000300u);
    load_instruction(state, cpu, 0x0300u, OPCODE_NOP);
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_write_word(cpu, 0x08c2u, 0x8000u);
    cpu->disicnt = 2u;
    cpu->w[15] = 0x5000u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 2u &&
               cpu->disicnt == 0u,
           "non-CPU SFR wait cycle completes DISI countdown");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 0x0302u &&
               cpu->w[15] == 0x5004u,
           "non-CPU SFR wait cycle releases new interrupt before next instruction");

