tylertms/dspic33e-sim/conformance/processor.c
    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, 0x090004u);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W1_POST_INCREMENT_W2);
    load_instruction(state, cpu, 0x0014u, 0x000300u);
    load_instruction(state, cpu, 0x0300u, OPCODE_NOP);
    load_instruction(state, cpu, 0x0302u, OPCODE_RETFIE);
    dspic33_set_working_register(cpu, 1u, 0xc000u);
    cpu->w[15] = 0x5000u;
    cpu->dsrpag = 0x0200u;
    cpu->disicnt = 7u;
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_write_word(cpu, 0x08c2u, 0x8000u);
    dspic33_raise_interrupt(cpu, 0u);
    expect_step_cycles(state, cpu, 1u, "interruptible PSV REPEAT setup");
    expect_step_cycles(state, cpu, 5u, "first interruptible repeated PSV access");
    expect_step_cycles(state, cpu, 5u,
                       "pre-interrupt repeated PSV access exits in five cycles");
    expect(state,
           cpu->disicnt == 0u && cpu->rcount == 2u && cpu->repeat_active != 0u &&
               cpu->w[1] == 0xc004u,
           "pre-interrupt PSV iteration preserves suspended repeat state");
    expect_step_cycles(state, cpu, 9u,
                       "interrupt dispatch executes handler instruction");
    expect(state,
           cpu->pc == 0x0302u && cpu->repeat_active == 0u && cpu->rcount == 2u &&
               (dspic33_read_word(cpu, 0x5002u) & 0x1000u) != 0u,
           "interrupt entry stacks optimized repeat state");
    dspic33_write_word(cpu, 0x0800u, 0u);
    expect_step_cycles(state, cpu, 6u, "RETFIE restores optimized repeat state");
    expect(state,
           cpu->repeat_active != 0u && cpu->repeat_psv_reentry && cpu->pc == 0x202u,
           "RETFIE arms PSV repeat re-entry timing");
    expect_step_cycles(state, cpu, 5u, "re-entered PSV repeat access uses five cycles");
    expect_step_cycles(state, cpu, 1u,
                       "resumed middle PSV repeat access uses one cycle");
    expect_step_cycles(state, cpu, 6u,
                       "resumed final PSV repeat access uses six cycles");
    expect(state,
           cpu->w[1] == 0xc00au && cpu->w[2] == 0x5555u && cpu->repeat_active == 0u &&
               !cpu->repeat_psv_started && !cpu->repeat_psv_reentry,
           "interrupted PSV repeat completes all iterations");

    cpu->repeat_psv_started = true;
    cpu->repeat_psv_reentry = true;
    cpu->psv_repeat_optimized = true;
    dspic33_reset(cpu, 0u);
    expect(state,
           !cpu->repeat_psv_started && !cpu->repeat_psv_reentry &&
               !cpu->psv_repeat_optimized,
           "reset clears PSV repeat timing state");
}

static void psv_program_hole_cases(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W1_POST_INCREMENT_W2);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0xa5a5u);
    dspic33_set_working_register(cpu, 3u, 0xbeefu);
    dspic33_write_word(cpu, 0x5008u, 0x1357u);
    cpu->dsrpag = 0x020au;
    expect_address_trap(state, cpu, "PSV program-hole word read traps");
    expect(state,
           cpu->w[1] == 0xd802u && cpu->w[2] == 0u && cpu->w[3] == 0xbeefu &&
               cpu->dsrpag == 0x020au && dspic33_read_word(cpu, 0x5008u) == 0x1357u &&
               cpu->cycles == 5u,
           "PSV program-hole word read completes destination and pointer");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_BYTE_W1_POST_INCREMENT_W2);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0xa5a5u);
    cpu->dsrpag = 0x020au;
    expect_address_trap(state, cpu, "PSV program-hole low-byte read traps");
    expect(state,
           cpu->w[1] == 0xd801u && cpu->w[2] == 0xa500u && cpu->dsrpag == 0x020au &&
               cpu->cycles == 5u,
           "PSV program-hole low-byte read preserves destination high byte");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_BYTE_W1_POST_INCREMENT_W2);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0x5a5au);
    cpu->dsrpag = 0x030au;
    expect_address_trap(state, cpu, "PSV program-hole high-byte read traps");
    expect(state,
           cpu->w[1] == 0xd801u && cpu->w[2] == 0x5a00u && cpu->dsrpag == 0x030au &&
               cpu->cycles == 5u,
           "PSV program-hole high-byte read preserves destination high byte");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_DOUBLE_W1_POST_INCREMENT_W2);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0xa5a5u);
    dspic33_set_working_register(cpu, 3u, 0x5a5au);
    cpu->dsrpag = 0x020au;
    expect_address_trap(state, cpu, "PSV program-hole MOV.D read traps");
    expect(state,
           cpu->w[1] == 0xd804u && cpu->w[2] == 0u && cpu->w[3] == 0u &&
               cpu->dsrpag == 0x020au && cpu->cycles == 5u && cpu->trap_count == 1u,
           "PSV program-hole MOV.D coalesces reads and completes pointer");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W1_MEMORY_W2_MEMORY);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0x5008u);
    dspic33_write_word(cpu, 0x5008u, 0x2468u);
    cpu->dsrpag = 0x020au;
    expect_address_trap(state, cpu, "PSV program-hole memory move traps");
    expect(state,
           cpu->w[1] == 0xd800u && cpu->w[2] == 0x5008u &&
               dspic33_read_word(cpu, 0x5008u) == 0x2468u && cpu->cycles == 5u,
           "PSV program-hole fault inhibits data destination write");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W1_POST_INCREMENT_W2);
    expect(state, dspic33_load_program_word(cpu, 0x557feu, 0x001357u),
           "load final implemented PSV word");
    dspic33_set_working_register(cpu, 1u, 0xd7feu);
    dspic33_set_working_register(cpu, 2u, 0xa5a5u);
    cpu->dsrpag = 0x020au;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[1] == 0xd800u &&
               cpu->w[2] == 0x1357u && cpu->dsrpag == 0x020au && !cpu->address_error &&
               cpu->cycles == 5u,
           "final implemented PSV word remains valid before hole boundary");

    reset_processor_conformance(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x01055800u) == 0u && !cpu->address_error,
           "raw PSV program-hole read bypasses CPU fault state");
}

static void address_register_dependency_cases(ProcessorConformance* state,
                                              Dspic33* cpu) {
    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_INDIRECT_W3);
    load_instruction(state, cpu, 0x204u, OPCODE_MOV_W2_W3);
    dspic33_write_word(cpu, 0x1000u, 0x4567u);
    expect_step_cycles(state, cpu, 1u, "direct pointer write uses one cycle");
    expect_step_cycles(state, cpu, 2u, "direct write to indirect source stalls");
    expect(state, cpu->w[3] == 0x4567u, "dependency stall preserves source value");
    expect_step_cycles(state, cpu, 1u, "direct source does not calculate an address");

