tylertms/dspic33e-sim/conformance/processor.c
    for (reg = 0u; reg < 16u; reg++) {
        if (cpu->w[reg] != registers[reg]) {
            return false;
        }
    }
    return true;
}

static void run_legal_binary_matrix_case(ProcessorConformance* state, Dspic33* cpu,
                                         uint32_t opcode,
                                         BinaryMatrixOperation operation) {
    uint8_t left_register = (uint8_t)((opcode >> 15u) & 0x0fu);
    uint8_t destination_register = (uint8_t)((opcode >> 7u) & 0x0fu);
    uint8_t destination_mode = (uint8_t)((opcode >> 11u) & 0x07u);
    uint8_t source_register = (uint8_t)(opcode & 0x0fu);
    uint8_t source_mode = (uint8_t)((opcode >> 4u) & 0x07u);
    bool byte_mode = (opcode & 0x004000u) != 0u;
    uint8_t width = byte_mode ? 1u : 2u;
    uint16_t initial_status =
        binary_matrix_logical(operation)
            ? (uint16_t)((opcode & 1u) | (((opcode >> 7u) & 1u) << 1u) |
                         (((opcode >> 8u) & 1u) << 2u) | (((opcode >> 9u) & 1u) << 3u) |
                         (((opcode >> 10u) & 1u) << 8u))
            : (uint16_t)((opcode & 1u) | (((opcode >> 7u) & 1u) << 1u));
    uint16_t registers[16];
    BinaryMatrixOperand source;
    BinaryMatrixOperand destination;
    uint16_t left;
    uint16_t right;
    uint16_t value;
    uint16_t expected_status;
    uint16_t source_value = byte_mode ? (uint16_t)(0x0040u | (opcode & 0x003fu))
                                      : (uint16_t)(0x2100u | (opcode & 0x00ffu));
    uint64_t cycles;
    bool matches;

    prepare_arithmetic_matrix_case(cpu, registers, initial_status);
    left = byte_mode ? (uint8_t)registers[left_register] : registers[left_register];
    if (source_mode >= 6u) {
        source.direct = false;
        source.address = 0u;
        right = (uint16_t)(opcode & 0x001fu);
    } else {
        source = binary_matrix_operand(registers, source_mode, source_register, width);
        right = source.direct ? (byte_mode ? (uint8_t)registers[source_register]
                                           : registers[source_register])
                              : source_value;
    }
    destination =
        binary_matrix_operand(registers, destination_mode, destination_register, width);
    if (!destination.direct) {
        if (byte_mode) {
            dspic33_write_byte(cpu, destination.address, 0x5au);
        } else {
            dspic33_write_word(cpu, destination.address, 0x5a5au);
        }
    }
    if (source_mode < 6u && !source.direct) {
        if (byte_mode) {
            dspic33_write_byte(cpu, source.address, (uint8_t)source_value);
        } else {
            dspic33_write_word(cpu, source.address, source_value);
        }
    }
    value = binary_matrix_result(operation, left, right, initial_status, byte_mode);
    expected_status =
        binary_matrix_status(operation, left, right, initial_status, byte_mode);
    if (destination.direct) {
        if (byte_mode) {
            value = (uint16_t)((registers[destination_register] & 0xff00u) |
                               (value & 0x00ffu));
        }
        binary_matrix_write_register(registers, destination_register, value);
    }
    cycles = cpu->cycles;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
              cpu->cycles - cycles == 1u && cpu->sr == expected_status &&
              cpu->corcon == 0x0020u && cpu->unsupported_opcode == 0u &&
              !cpu->address_error && !cpu->illegal_reset &&
              cpu->last_trap == UINT16_MAX &&
              binary_matrix_registers_match(cpu, registers);
    if (!destination.direct) {
        matches =
            matches &&
            (byte_mode ? dspic33_read_byte(cpu, destination.address) == (uint8_t)value
                       : dspic33_read_word(cpu, destination.address) == value);
    }
    if (source_mode < 6u && !source.direct &&
        (destination.direct || destination.address != source.address)) {
        matches =
            matches &&
            (byte_mode ? dspic33_read_byte(cpu, source.address) == (uint8_t)source_value
                       : dspic33_read_word(cpu, source.address) == source_value);
    }
    expect_dsp_matrix_case(state, matches, opcode, "legal binary encoding");
}

static void run_invalid_binary_matrix_case(ProcessorConformance* state, Dspic33* cpu,
                                           uint32_t opcode) {
    uint64_t illegal_resets;
    bool matches;
    uint8_t reg;

    cpu->pc = 0u;
    cpu->sr = 0x010fu;
    cpu->corcon = 0x0020u;
    cpu->illegal_reset = false;
    cpu->last_trap = UINT16_MAX;
    cpu->stop_reason = DSPIC33_RUNNING;
    cpu->splim_enabled = false;
    for (reg = 0u; reg < 16u; reg++) {
        dspic33_set_working_register(cpu, reg,
                                     (uint16_t)(0x5000u + (uint16_t)reg * 2u));
    }
    dspic33_write_word(cpu, 0x5000u, 0xa5a5u);
    illegal_resets = cpu->illegal_reset_count;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->illegal_reset &&
              cpu->illegal_reset_count == illegal_resets + 1u &&
              cpu->last_trap == UINT16_MAX && cpu->pc == 0u && cpu->w[15] == 0x1000u &&
              cpu->initialized_working_registers == 0x8000u &&
              (dspic33_read_word(cpu, 0x0740u) & 0x4000u) != 0u &&
              dspic33_read_word(cpu, 0x5000u) == 0xa5a5u;
    for (reg = 0u; reg < 15u; reg++) {
        matches = matches && cpu->w[reg] == 0u;
    }
    expect_dsp_matrix_case(state, matches, opcode, "illegal binary encoding");
}

static void general_arithmetic_encoding_matrix_cases(ProcessorConformance* state,
                                                     Dspic33* cpu) {
    static const uint32_t bases[6] = {0x100000u, 0x180000u, 0x400000u,
                                      0x480000u, 0x500000u, 0x580000u};
    uint32_t legal = 0u;
    uint32_t invalid = 0u;
    uint8_t operation;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (operation = 0u; operation < 6u; operation++) {
        uint32_t fields;
        for (fields = 0u; fields < 0x080000u; fields++) {
            uint32_t opcode = bases[operation] | fields;
            uint8_t destination_mode = (uint8_t)((opcode >> 11u) & 0x07u);
            if (destination_mode >= 6u) {
                run_invalid_binary_matrix_case(state, cpu, opcode);
                invalid++;
            } else {
                run_legal_binary_matrix_case(state, cpu, opcode,
                                             (BinaryMatrixOperation)operation);
                legal++;
            }
        }
    }
    expect(state, legal == 2359296u,
           "general arithmetic legal encoding matrix is exhaustive");
    expect(state, invalid == 786432u,
           "general arithmetic illegal encoding matrix is exhaustive");
}

