tylertms/dspic33e-sim/conformance/processor.c
static void general_logical_encoding_matrix_cases(ProcessorConformance* state,
                                                  Dspic33* cpu) {
    static const uint32_t bases[3] = {0x600000u, 0x680000u, 0x700000u};
    static const BinaryMatrixOperation operations[3] = {
        ARITHMETIC_MATRIX_AND, ARITHMETIC_MATRIX_XOR, ARITHMETIC_MATRIX_IOR};
    uint32_t legal = 0u;
    uint32_t invalid = 0u;
    uint8_t operation;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (operation = 0u; operation < 3u; operation++) {
        uint32_t fields;
        for (fields = 0u; fields < 0x080000u; fields++) {
            uint32_t opcode = bases[operation] | fields;
            uint8_t destination_mode = (uint8_t)((opcode >> 11u) & 0x07u);
            if (destination_mode >= 6u) {
                run_invalid_binary_matrix_case(state, cpu, opcode);
                invalid++;
            } else {
                run_legal_binary_matrix_case(state, cpu, opcode, operations[operation]);
                legal++;
            }
        }
    }
    expect(state, legal == 1179648u,
           "general logical legal encoding matrix is exhaustive");
    expect(state, invalid == 393216u,
           "general logical illegal encoding matrix is exhaustive");
}

static void run_literal_binary_matrix_case(ProcessorConformance* state, Dspic33* cpu,
                                           uint32_t opcode,
                                           BinaryMatrixOperation operation,
                                           uint16_t literal, bool byte_mode) {
    uint8_t destination = (uint8_t)(opcode & 0x0fu);
    uint16_t initial_status =
        binary_matrix_logical(operation)
            ? (uint16_t)((destination & 1u) | (((literal >> 1u) & 1u) << 1u) |
                         (((literal >> 2u) & 1u) << 2u) |
                         (((literal >> 3u) & 1u) << 3u) |
                         (((literal >> 4u) & 1u) << 8u))
            : (uint16_t)((destination & 1u) | (((literal >> 1u) & 1u) << 1u));
    static const uint16_t byte_values[4] = {0x0000u, 0x0080u, 0x00ffu, 0x0055u};
    static const uint16_t word_values[4] = {0x0000u, 0x8000u, 0xffffu, 0x5555u};
    uint16_t left =
        byte_mode ? byte_values[destination & 3u] : word_values[destination & 3u];
    uint16_t expected;
    uint16_t expected_status;
    uint64_t cycles;
    bool matches;

    cpu->pc = 0u;
    cpu->sr = initial_status;
    cpu->corcon = 0x0020u;
    cpu->unsupported_opcode = 0u;
    cpu->last_trap = UINT16_MAX;
    cpu->address_error = false;
    cpu->illegal_reset = false;
    cpu->stop_reason = DSPIC33_RUNNING;
    cpu->events.count = 0u;
    dspic33_set_working_register(cpu, destination,
                                 byte_mode ? (uint16_t)(0xa500u | left) : left);
    left = byte_mode ? (uint8_t)cpu->w[destination] : cpu->w[destination];
    expected =
        binary_matrix_result(operation, left, literal, initial_status, byte_mode);
    expected_status =
        binary_matrix_status(operation, left, literal, initial_status, byte_mode);
    if (byte_mode) {
        expected = (uint16_t)((cpu->w[destination] & 0xff00u) | expected);
    }
    if (destination == 15u) {
        expected &= 0xfffeu;
    }
    cycles = cpu->cycles;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
              cpu->cycles - cycles == 1u && cpu->w[destination] == expected &&
              cpu->sr == expected_status && cpu->corcon == 0x0020u &&
              cpu->unsupported_opcode == 0u && !cpu->address_error &&
              !cpu->illegal_reset && cpu->last_trap == UINT16_MAX;
    expect_dsp_matrix_case(state, matches, opcode, "literal binary encoding");
}

static void literal_arithmetic_encoding_matrix_cases(ProcessorConformance* state,
                                                     Dspic33* cpu) {
    static const uint32_t bases[4] = {0xb00000u, 0xb08000u, 0xb10000u, 0xb18000u};
    static const BinaryMatrixOperation operations[4] = {
        ARITHMETIC_MATRIX_ADD, ARITHMETIC_MATRIX_ADDC, ARITHMETIC_MATRIX_SUB,
        ARITHMETIC_MATRIX_SUBB};
    uint32_t cases = 0u;
    uint8_t operation;
    uint8_t byte_mode;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (operation = 0u; operation < 4u; operation++) {
        for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
            uint16_t maximum = byte_mode != 0u ? UINT8_MAX : 0x03ffu;
            uint16_t literal;
            for (literal = 0u; literal <= maximum; literal++) {
                uint8_t destination;
                for (destination = 0u; destination < 16u; destination++) {
                    uint32_t opcode = bases[operation] | ((uint32_t)byte_mode << 14u) |
                                      ((uint32_t)literal << 4u) | destination;
                    run_literal_binary_matrix_case(state, cpu, opcode,
                                                   operations[operation], literal,
                                                   byte_mode != 0u);
                    cases++;
                }
            }
        }
    }
    expect(state, cases == 81920u,
           "literal arithmetic encoding matrix covers every valid form");
}

static void literal_logical_encoding_matrix_cases(ProcessorConformance* state,
                                                  Dspic33* cpu) {
    static const uint32_t bases[3] = {0xb20000u, 0xb28000u, 0xb30000u};
    static const BinaryMatrixOperation operations[3] = {
        ARITHMETIC_MATRIX_AND, ARITHMETIC_MATRIX_XOR, ARITHMETIC_MATRIX_IOR};
    uint32_t legal = 0u;
    uint32_t invalid = 0u;
    uint8_t operation;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (operation = 0u; operation < 3u; operation++) {
        uint8_t byte_mode;
        for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
            uint16_t maximum = byte_mode != 0u ? UINT8_MAX : 0x03ffu;
            uint16_t literal;
            for (literal = 0u; literal <= maximum; literal++) {
                uint8_t destination;
                for (destination = 0u; destination < 16u; destination++) {
                    uint32_t opcode = bases[operation] | ((uint32_t)byte_mode << 14u) |
                                      ((uint32_t)literal << 4u) | destination;
                    run_literal_binary_matrix_case(state, cpu, opcode,
                                                   operations[operation], literal,
                                                   byte_mode != 0u);
                    legal++;
                }
            }
        }
    }
    for (uint32_t opcode = 0xb38000u; opcode < 0xb40000u; opcode++) {
        if ((opcode & 0xfff000u) != 0xb3c000u) {
            run_invalid_binary_matrix_case(state, cpu, opcode);
            invalid++;
        }
    }
    expect(state, legal == 61440u,
           "literal logical legal encoding matrix is exhaustive");
    expect(state, invalid == 28672u,
           "literal logical illegal encoding matrix is exhaustive");
}

static void arithmetic_flag_boundary_cases(ProcessorConformance* state, Dspic33* cpu) {
    static const uint32_t bases[6] = {0x100000u, 0x180000u, 0x400000u,
                                      0x480000u, 0x500000u, 0x580000u};
    static const uint16_t byte_values[8] = {0x00u, 0x01u, 0x0fu, 0x10u,
                                            0x7fu, 0x80u, 0xfeu, 0xffu};
    static const uint16_t word_values[8] = {0x0000u, 0x0001u, 0x00ffu, 0x0100u,
                                            0x7fffu, 0x8000u, 0xfffeu, 0xffffu};
    uint32_t cases = 0u;
    uint8_t operation;
    uint8_t byte_mode;
    uint8_t left_index;
    uint8_t right_index;
    uint8_t carry;
    uint8_t zero;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (operation = 0u; operation < 6u; operation++) {
        for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
            const uint16_t* values = byte_mode != 0u ? byte_values : word_values;
            for (left_index = 0u; left_index < 8u; left_index++) {
                for (right_index = 0u; right_index < 8u; right_index++) {
                    for (carry = 0u; carry < 2u; carry++) {
                        for (zero = 0u; zero < 2u; zero++) {
                            uint16_t initial_status =
                                (uint16_t)(carry | ((uint16_t)zero << 1u));
                            uint32_t opcode = bases[operation] | ((uint32_t)2u << 15u) |
                                              ((uint32_t)byte_mode << 14u) |
                                              ((uint32_t)4u << 7u) | 3u;
                            uint16_t expected = binary_matrix_result(
                                (BinaryMatrixOperation)operation, values[left_index],
                                values[right_index], initial_status, byte_mode != 0u);
                            uint16_t expected_status = binary_matrix_status(
                                (BinaryMatrixOperation)operation, values[left_index],
                                values[right_index], initial_status, byte_mode != 0u);
                            bool matches;

                            cpu->pc = 0u;
                            cpu->sr = initial_status;
                            cpu->corcon = 0x0020u;
                            cpu->unsupported_opcode = 0u;
                            cpu->last_trap = UINT16_MAX;
                            cpu->address_error = false;
                            cpu->illegal_reset = false;
                            cpu->stop_reason = DSPIC33_RUNNING;
                            cpu->events.count = 0u;
                            dspic33_set_working_register(cpu, 2u, values[left_index]);
                            dspic33_set_working_register(cpu, 3u, values[right_index]);
                            dspic33_set_working_register(cpu, 4u, 0xa55au);
                            if (byte_mode != 0u) {
                                expected = (uint16_t)(0xa500u | expected);
                            }
                            matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                                      dspic33_step(cpu) == DSPIC33_RUNNING &&
                                      cpu->pc == 2u && cpu->w[4] == expected &&
                                      cpu->sr == expected_status &&
                                      cpu->unsupported_opcode == 0u &&
                                      !cpu->address_error && !cpu->illegal_reset;
                            expect_dsp_matrix_case(state, matches, opcode,
                                                   "arithmetic flag boundary");
                            cases++;
                        }
                    }
                }
            }
        }
    }
    expect(state, cases == 3072u, "arithmetic flag boundary matrix is exhaustive");
}

