tylertms/dspic33e-sim/conformance/processor.c
static void arithmetic_encoding_matrix_cases(ProcessorConformance* state,
                                             Dspic33* cpu) {
    general_arithmetic_encoding_matrix_cases(state, cpu);
    general_logical_encoding_matrix_cases(state, cpu);
    literal_arithmetic_encoding_matrix_cases(state, cpu);
    literal_logical_encoding_matrix_cases(state, cpu);
    arithmetic_flag_boundary_cases(state, cpu);
}

static bool direct_file_address_implemented(uint16_t address) {
    uint16_t target = (uint16_t)(address & 0x0ffeu);
    size_t low = 0u;
    size_t high = DSPIC33_SFR_ACCESS_ADDRESS_COUNT;

    if (address >= 0x1000u) {
        return true;
    }
    while (low < high) {
        size_t middle = low + (high - low) / 2u;
        uint16_t candidate = dspic33_sfr_access_expectations[middle].address;
        if (candidate < target) {
            low = middle + 1u;
        } else {
            high = middle;
        }
    }
    return low < DSPIC33_SFR_ACCESS_ADDRESS_COUNT &&
           dspic33_sfr_access_expectations[low].address == target;
}

static bool direct_file_reads_source(DirectFileOperation operation) {
    return operation != DIRECT_FILE_CLR && operation != DIRECT_FILE_SETM;
}

static bool direct_file_writes_result(DirectFileOperation operation) {
    return operation < DIRECT_FILE_CP;
}

static uint16_t direct_file_result(DirectFileOperation operation, uint16_t left,
                                   uint16_t right, uint16_t initial_status,
                                   bool byte_mode) {
    uint16_t mask = byte_mode ? 0x00ffu : 0xffffu;

    if (operation <= DIRECT_FILE_SUBB) {
        return binary_matrix_result((BinaryMatrixOperation)operation, left, right,
                                    initial_status, byte_mode);
    }
    if (operation == DIRECT_FILE_AND) {
        return (uint16_t)((left & right) & mask);
    }
    if (operation == DIRECT_FILE_XOR) {
        return (uint16_t)((left ^ right) & mask);
    }
    if (operation == DIRECT_FILE_IOR) {
        return (uint16_t)((left | right) & mask);
    }
    if (operation == DIRECT_FILE_INC || operation == DIRECT_FILE_INC2) {
        return binary_matrix_result(ARITHMETIC_MATRIX_ADD, left,
                                    operation == DIRECT_FILE_INC2 ? 2u : 1u,
                                    initial_status, byte_mode);
    }
    if (operation == DIRECT_FILE_DEC || operation == DIRECT_FILE_DEC2) {
        return binary_matrix_result(ARITHMETIC_MATRIX_SUB, left,
                                    operation == DIRECT_FILE_DEC2 ? 2u : 1u,
                                    initial_status, byte_mode);
    }
    if (operation == DIRECT_FILE_NEG) {
        return binary_matrix_result(ARITHMETIC_MATRIX_SUB, 0u, left, initial_status,
                                    byte_mode);
    }
    if (operation == DIRECT_FILE_COM) {
        return (uint16_t)(~left & mask);
    }
    if (operation == DIRECT_FILE_CP) {
        return binary_matrix_result(ARITHMETIC_MATRIX_SUB, left, right, initial_status,
                                    byte_mode);
    }
    if (operation == DIRECT_FILE_CPB) {
        return binary_matrix_result(ARITHMETIC_MATRIX_SUBB, left, right, initial_status,
                                    byte_mode);
    }
    if (operation == DIRECT_FILE_CP0) {
        return binary_matrix_result(ARITHMETIC_MATRIX_SUB, left, 0u, initial_status,
                                    byte_mode);
    }
    return operation == DIRECT_FILE_SETM ? mask : 0u;
}

static uint16_t direct_file_logic_status(uint16_t initial_status, uint16_t value,
                                         bool byte_mode) {
    uint16_t mask = byte_mode ? 0x00ffu : 0xffffu;
    uint16_t sign = byte_mode ? 0x0080u : 0x8000u;
    uint16_t status = (uint16_t)(initial_status & ~0x000au);

    value &= mask;
    if (value == 0u) {
        status |= 0x0002u;
    }
    if ((value & sign) != 0u) {
        status |= 0x0008u;
    }
    return status;
}

static uint16_t direct_file_status(DirectFileOperation operation, uint16_t left,
                                   uint16_t right, uint16_t initial_status,
                                   bool byte_mode) {
    uint16_t value =
        direct_file_result(operation, left, right, initial_status, byte_mode);

    if (operation <= DIRECT_FILE_SUBB) {
        return binary_matrix_status((BinaryMatrixOperation)operation, left, right,
                                    initial_status, byte_mode);
    }
    if (operation <= DIRECT_FILE_IOR || operation == DIRECT_FILE_COM) {
        return direct_file_logic_status(initial_status, value, byte_mode);
    }
    if (operation == DIRECT_FILE_INC || operation == DIRECT_FILE_INC2) {
        return binary_matrix_status(ARITHMETIC_MATRIX_ADD, left,
                                    operation == DIRECT_FILE_INC2 ? 2u : 1u,
                                    initial_status, byte_mode);
    }
    if (operation == DIRECT_FILE_DEC || operation == DIRECT_FILE_DEC2) {
        return binary_matrix_status(ARITHMETIC_MATRIX_SUB, left,
                                    operation == DIRECT_FILE_DEC2 ? 2u : 1u,
                                    initial_status, byte_mode);
    }
    if (operation == DIRECT_FILE_NEG) {
        return binary_matrix_status(ARITHMETIC_MATRIX_SUB, 0u, left, initial_status,
                                    byte_mode);
    }
    if (operation == DIRECT_FILE_CP) {
        return binary_matrix_status(ARITHMETIC_MATRIX_SUB, left, right, initial_status,
                                    byte_mode);
    }
    if (operation == DIRECT_FILE_CPB) {
        return binary_matrix_status(ARITHMETIC_MATRIX_SUBB, left, right, initial_status,
                                    byte_mode);
    }
    if (operation == DIRECT_FILE_CP0) {
        return binary_matrix_status(ARITHMETIC_MATRIX_SUB, left, 0u, initial_status,
                                    byte_mode);
    }
    return initial_status;
}

static void run_legal_unary_matrix_case(ProcessorConformance* state, Dspic33* cpu,
                                        uint32_t opcode,
                                        DirectFileOperation operation) {
    uint8_t source_mode = (uint8_t)((opcode >> 4u) & 0x07u);
    uint8_t source_register = (uint8_t)(opcode & 0x0fu);
    uint8_t destination_mode = (uint8_t)((opcode >> 11u) & 0x07u);
    uint8_t destination_register = (uint8_t)((opcode >> 7u) & 0x0fu);
    bool byte_mode = (opcode & 0x004000u) != 0u;
    uint8_t width = byte_mode ? 1u : 2u;
    bool reads_source = direct_file_reads_source(operation);
    uint16_t initial_status =
        (uint16_t)((opcode & 1u) | (((opcode >> 7u) & 1u) << 1u) |
                   (((opcode >> 8u) & 1u) << 2u) | (((opcode >> 9u) & 1u) << 3u) |
                   (((opcode >> 10u) & 1u) << 8u));
    uint16_t registers[16];
    BinaryMatrixOperand source = {0u, true};
    BinaryMatrixOperand destination;
    uint16_t source_value = byte_mode ? (uint16_t)(0x0040u | (opcode & 0x003fu))
                                      : (uint16_t)(0x2100u | (opcode & 0x00ffu));
    uint16_t source_operand = 0u;
    uint16_t value;
    uint16_t expected_status;
    uint64_t cycles;
    bool matches;

    prepare_arithmetic_matrix_case(cpu, registers, initial_status);
    if (reads_source) {
        source = binary_matrix_operand(registers, source_mode, source_register, width);
        source_operand = source.direct
                             ? (byte_mode ? (uint8_t)registers[source_register]
                                          : registers[source_register])
                             : source_value;
    }
    destination =
        binary_matrix_operand(registers, destination_mode, destination_register, width);
    if (!destination.direct) {
        if (byte_mode) {
            dspic33_write_byte(cpu, destination.address, 0x5au);
        } else {
            dspic33_write_word(cpu, destination.address, 0x5a5au);
        }
    }
    if (reads_source && !source.direct) {
        if (byte_mode) {
            dspic33_write_byte(cpu, source.address, (uint8_t)source_value);
        } else {
            dspic33_write_word(cpu, source.address, source_value);
        }
    }
    value =
        direct_file_result(operation, source_operand, 0u, initial_status, byte_mode);
    expected_status =
        direct_file_status(operation, source_operand, 0u, initial_status, byte_mode);
    if (destination.direct) {
        if (byte_mode) {
            value = (uint16_t)((registers[destination_register] & 0xff00u) |
                               (value & 0x00ffu));
        }
        binary_matrix_write_register(registers, destination_register, value);
    }
    cycles = cpu->cycles;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
              cpu->cycles - cycles == 1u && cpu->sr == expected_status &&
              cpu->corcon == 0x0020u && cpu->unsupported_opcode == 0u &&
              !cpu->address_error && !cpu->illegal_reset &&
              cpu->last_trap == UINT16_MAX &&
              binary_matrix_registers_match(cpu, registers);
    if (!destination.direct) {
        matches =
            matches &&
            (byte_mode ? dspic33_read_byte(cpu, destination.address) == (uint8_t)value
                       : dspic33_read_word(cpu, destination.address) == value);
    }
    if (reads_source && !source.direct &&
        (destination.direct || destination.address != source.address)) {
        matches =
            matches &&
            (byte_mode ? dspic33_read_byte(cpu, source.address) == (uint8_t)source_value
                       : dspic33_read_word(cpu, source.address) == source_value);
    }
    expect_dsp_matrix_case(state, matches, opcode, "legal unary encoding");
}

static void general_unary_encoding_matrix_cases(ProcessorConformance* state,
                                                Dspic33* cpu) {
    static const DirectFileOperation operations[4][2] = {
        {DIRECT_FILE_INC, DIRECT_FILE_INC2},
        {DIRECT_FILE_DEC, DIRECT_FILE_DEC2},
        {DIRECT_FILE_NEG, DIRECT_FILE_COM},
        {DIRECT_FILE_CLR, DIRECT_FILE_SETM}};
    uint32_t legal = 0u;
    uint32_t invalid = 0u;
    uint32_t fields;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (fields = 0u; fields < 0x040000u; fields++) {
        uint32_t opcode = 0xe80000u | fields;
        uint8_t family = (uint8_t)((opcode >> 16u) - 0xe8u);
        uint8_t alternate = (uint8_t)((opcode >> 15u) & 1u);
        uint8_t destination_mode = (uint8_t)((opcode >> 11u) & 0x07u);
        uint8_t source_mode = (uint8_t)((opcode >> 4u) & 0x07u);
        bool nullary = family == 3u;
        bool valid = destination_mode < 6u &&
                     (nullary ? (opcode & 0x00007fu) == 0u : source_mode < 6u);

