tylertms/dspic33e-sim/conformance/processor.c
        if (valid) {
            run_legal_unary_matrix_case(state, cpu, opcode,
                                        operations[family][alternate]);
            legal++;
        } else {
            run_invalid_binary_matrix_case(state, cpu, opcode);
            invalid++;
        }
    }
    expect(state, legal == 110976u,
           "general unary legal encoding matrix is exhaustive");
    expect(state, invalid == 151168u,
           "general unary illegal encoding matrix is exhaustive");
}

static uint16_t direct_file_boundary_value(uint8_t index, bool byte_mode) {
    static const uint16_t byte_values[32] = {
        0x00u, 0x01u, 0x02u, 0x0eu, 0x0fu, 0x10u, 0x7du, 0x7eu, 0x7fu, 0x80u, 0x81u,
        0xfdu, 0xfeu, 0xffu, 0x55u, 0xaau, 0x8eu, 0x8fu, 0x90u, 0x91u, 0xf0u, 0x11u,
        0x22u, 0x33u, 0x44u, 0x66u, 0x77u, 0x88u, 0x99u, 0xbbu, 0xccu, 0xddu};
    static const uint16_t word_values[32] = {
        0x0000u, 0x0001u, 0x0002u, 0x00feu, 0x00ffu, 0x0100u, 0x7ffdu, 0x7ffeu,
        0x7fffu, 0x8000u, 0x8001u, 0xfffdu, 0xfffeu, 0xffffu, 0x5555u, 0xaaaau,
        0x80feu, 0x80ffu, 0x8100u, 0x8101u, 0xff00u, 0x1111u, 0x2222u, 0x3333u,
        0x4444u, 0x6666u, 0x7777u, 0x8888u, 0x9999u, 0xbbbbu, 0xccccu, 0xddddu};

    return byte_mode ? byte_values[index & 0x1fu] : word_values[index & 0x1fu];
}

static void prepare_direct_file_case(Dspic33* cpu, uint16_t address, bool byte_mode) {
    uint8_t reg;
    uint16_t initial_status =
        (uint16_t)(((address >> 10u) & 1u) | (((address >> 11u) & 1u) << 1u));
    uint16_t operand = direct_file_boundary_value((uint8_t)(address >> 5u), byte_mode);
    uint16_t source = direct_file_boundary_value((uint8_t)address, byte_mode);

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    cpu->stop_on_trap = true;
    cpu->instructions = 0u;
    cpu->cycles = 0u;
    cpu->device_cycles = 0u;
    cpu->interrupt_count = 0u;
    cpu->software_reset_count = 0u;
    cpu->illegal_reset_count = 0u;
    cpu->trap_count = 0u;
    for (reg = 0u; reg < 15u; reg++) {
        dspic33_set_working_register(
            cpu, reg, (uint16_t)(0x4200u + (uint16_t)reg * 0x0101u + address));
    }
    dspic33_set_working_register(cpu, 0u,
                                 byte_mode ? (uint16_t)(0xa500u | operand) : operand);
    dspic33_set_working_register(cpu, 15u, 0x5000u);
    cpu->sr = initial_status;
    cpu->corcon = 0x0020u;
    if (address >= 0x1000u) {
        if (byte_mode) {
            dspic33_write_word(cpu, address & 0xfffeu, 0x5aa5u);
            dspic33_write_byte(cpu, address, (uint8_t)source);
        } else {
            dspic33_write_word(cpu, address & 0xfffeu, source);
        }
    }
}

static void write_direct_file_reference_result(Dspic33* cpu, uint16_t value,
                                               bool byte_mode) {
    if (byte_mode) {
        cpu->w[0] = (uint16_t)((cpu->w[0] & 0xff00u) | (value & 0x00ffu));
    } else {
        cpu->w[0] = value;
        cpu->initialized_working_registers |= 0x0001u;
    }
    cpu->instruction_working_register_writes |= 0x0001u;
}

static bool direct_file_event_queues_match(const Dspic33* actual,
                                           const Dspic33* expected) {
    return actual->events.count == expected->events.count &&
           (actual->events.count == 0u ||
            memcmp(actual->events.items, expected->events.items,
                   actual->events.count * sizeof(*actual->events.items)) == 0);
}

static bool direct_file_io_states_match(const Dspic33* actual,
                                        const Dspic33* expected) {
    static Dspic33Io actual_io;
    static Dspic33Io expected_io;

    memcpy(&actual_io, &actual->io, sizeof(actual_io));
    memcpy(&expected_io, &expected->io, sizeof(expected_io));
    actual_io.cpu_write_cycle = expected_io.cpu_write_cycle;
    actual_io.cpu_write_address = expected_io.cpu_write_address;
    actual_io.cpu_write_previous = expected_io.cpu_write_previous;
    actual_io.cpu_write_width = expected_io.cpu_write_width;
    actual_io.cpu_write_valid = expected_io.cpu_write_valid;
    actual_io.cpu_read_address = expected_io.cpu_read_address;
    actual_io.cpu_read_width = expected_io.cpu_read_width;
    actual_io.cpu_read_valid = expected_io.cpu_read_valid;
    return memcmp(&actual_io, &expected_io, sizeof(actual_io)) == 0;
}

static bool direct_file_states_match(const Dspic33* actual, const Dspic33* expected) {
    static Dspic33 actual_state;
    static Dspic33 expected_state;

    memcpy(&actual_state, actual, sizeof(actual_state));
    memcpy(&expected_state, expected, sizeof(expected_state));

    actual_state.program = NULL;
    actual_state.auxiliary_program = NULL;
    actual_state.persistent_program = NULL;
    actual_state.data = NULL;
    actual_state.events.items = NULL;
    actual_state.events.capacity = 0u;
    expected_state.program = NULL;
    expected_state.auxiliary_program = NULL;
    expected_state.persistent_program = NULL;
    expected_state.data = NULL;
    expected_state.events.items = NULL;
    expected_state.events.capacity = 0u;
    return memcmp(&actual_state, &expected_state, sizeof(actual_state)) == 0 &&
           memcmp(actual->data, expected->data, 0x2000u) == 0 &&
           direct_file_event_queues_match(actual, expected);
}

static uint16_t run_direct_file_reference(Dspic33* cpu, DirectFileOperation operation,
                                          uint16_t address, bool byte_mode,
                                          bool file_destination) {
    uint64_t device_ratio = dspic33_device_instruction_cycles(cpu, 1u);
    bool reads_source = direct_file_reads_source(operation);
    bool writes_result = direct_file_writes_result(operation);
    bool non_cpu_sfr = reads_source &&
                       (address & (byte_mode ? 0xffffu : 0xfffeu)) >= 0x005au &&
                       address < 0x1000u && direct_file_address_implemented(address);
    uint16_t initial_status = cpu->sr;
    uint16_t right = byte_mode ? (uint8_t)cpu->w[0] : cpu->w[0];
    uint16_t left = 0u;
    uint16_t value;
    uint16_t status;
    uint8_t instruction_cycles = non_cpu_sfr ? 2u : 1u;
    size_t index;

    cpu->pc = 2u;
    cpu->instructions++;
    cpu->non_cpu_sfr_read = non_cpu_sfr;
    cpu->psv_read = false;
    cpu->psv_repeat_optimized = false;
    cpu->instruction_working_register_writes = 0u;
    cpu->instruction_source_address_registers = 0u;
    cpu->current_instruction_cycles = 1u;
    cpu->current_instruction_pc = 0u;
    cpu->instruction_active = true;
    if (reads_source) {
        left = byte_mode ? dspic33_read_byte(cpu, address)
                         : dspic33_read_word(cpu, address);
    }
    value = direct_file_result(operation, left, right, initial_status, byte_mode);
    status = direct_file_status(operation, left, right, initial_status, byte_mode);
    cpu->sr = status;
    if (writes_result) {
        if (file_destination) {
            if (byte_mode) {
                dspic33_write_byte(cpu, address, (uint8_t)value);
            } else {
                dspic33_write_word(cpu, address, value);
            }
        } else {
            write_direct_file_reference_result(cpu, value, byte_mode);
        }
    }
    cpu->instruction_active = false;
    cpu->previous_working_register_writes = cpu->instruction_working_register_writes;
    cpu->current_instruction_cycles = 0u;
    cpu->non_cpu_sfr_read = false;
    cpu->psv_read = false;
    cpu->psv_repeat_optimized = false;
    cpu->instruction_advancing = true;
    if (non_cpu_sfr) {
        dspic33_device_advance_instruction(cpu, 1u, device_ratio);
        dspic33_device_advance_instruction(cpu, 1u, device_ratio);
    } else {
        dspic33_device_advance_instruction(cpu, 1u, device_ratio);
    }
    for (index = 0u; index < 4u; index++) {
        Dspic33PendingSoftTrap* pending = &cpu->pending_soft_traps[index];
        if (pending->active && pending->delay != 0u) {
            pending->delay = pending->delay > instruction_cycles
                                 ? (uint8_t)(pending->delay - instruction_cycles)
                                 : 0u;
        }
    }
    cpu->instruction_advancing = false;
    return value;
}

static const Dspic33PendingSoftTrap* direct_file_pending_trap(const Dspic33* cpu) {
    const Dspic33PendingSoftTrap* selected = NULL;
    uint8_t current_priority = (uint8_t)(((cpu->corcon & 0x0008u) != 0u ? 8u : 0u) |
                                         ((cpu->sr >> 5u) & 0x07u));
    size_t index;

