tylertms/dspic33e-sim/conformance/processor.c
    for (index = 0u; index < 4u; index++) {
        const Dspic33PendingSoftTrap* pending = &cpu->pending_soft_traps[index];
        if (pending->active && pending->delay == 0u &&
            pending->priority > current_priority &&
            (selected == NULL || pending->priority > selected->priority)) {
            selected = pending;
        }
    }
    return selected;
}

static bool direct_file_trap_register_state_matches(const Dspic33* actual,
                                                    const Dspic33* expected) {
    const Dspic33PendingSoftTrap* pending = direct_file_pending_trap(expected);
    uint16_t stacked_high;
    uint16_t final_status;
    uint16_t final_control;

    if (pending == NULL) {
        return direct_file_states_match(actual, expected);
    }
    stacked_high = (uint16_t)(((expected->sr & 0x00ffu) << 8u) |
                              ((expected->corcon & 0x0008u) != 0u ? 0x0080u : 0u));
    final_status =
        (uint16_t)((expected->sr & ~0x00e0u) | ((pending->priority & 7u) << 5u));
    final_status &= (uint16_t)~0x0010u;
    final_control = pending->priority > 7u
                        ? (uint16_t)((expected->corcon & ~0x0004u) | 0x0008u)
                        : (uint16_t)(expected->corcon & ~(uint16_t)0x000cu);
    return actual->stop_reason == DSPIC33_TRAPPED &&
           actual->last_trap == pending->trap && actual->last_trap_return == 2u &&
           actual->pc == 0x000340u && actual->w[15] == 0x5004u &&
           actual->sr == final_status && actual->corcon == final_control &&
           actual->trap_count == 1u && actual->interrupt_depth == 1u &&
           memcmp(actual->w, expected->w, 15u * sizeof(*actual->w)) == 0 &&
           memcmp(actual->data, expected->data, 0x08c8u) == 0 &&
           memcmp(actual->data + 0x08cau, expected->data + 0x08cau,
                  0x2000u - 0x08cau) == 0 &&
           (uint16_t)(actual->data[0x08c8u] |
                      ((uint16_t)actual->data[0x08c9u] << 8u)) ==
               (uint16_t)(((uint16_t)pending->priority << 8u) | pending->trap) &&
           (uint16_t)(actual->data[0x5000u] |
                      ((uint16_t)actual->data[0x5001u] << 8u)) == 2u &&
           (uint16_t)(actual->data[0x5002u] |
                      ((uint16_t)actual->data[0x5003u] << 8u)) == stacked_high &&
           direct_file_io_states_match(actual, expected) &&
           direct_file_event_queues_match(actual, expected);
}

static bool run_direct_file_odd_word_case(Dspic33* cpu, Dspic33* reference,
                                          uint32_t opcode,
                                          DirectFileOperation operation,
                                          uint16_t address, bool file_destination) {
    uint16_t initial_status = reference->sr;
    uint16_t right = reference->w[0];
    bool reads_source = direct_file_reads_source(operation);
    uint16_t left = 0u;
    uint16_t value;
    uint16_t status;
    bool matches;
    bool writes_result = direct_file_writes_result(operation);
    uint64_t device_ratio = dspic33_device_instruction_cycles(reference, 1u);
    bool non_cpu_sfr = reads_source && address >= 0x005bu && address < 0x1000u &&
                       direct_file_address_implemented(address);
    uint64_t expected_cycles = reads_source && address >= 0x005bu &&
                                       address < 0x1000u &&
                                       direct_file_address_implemented(address)
                                   ? 2u
                                   : 1u;
    reference->pc = 2u;
    reference->instructions++;
    reference->non_cpu_sfr_read = non_cpu_sfr;
    reference->psv_read = false;
    reference->psv_repeat_optimized = false;
    reference->instruction_working_register_writes = 0u;
    reference->instruction_source_address_registers = 0u;
    reference->current_instruction_cycles = 1u;
    reference->current_instruction_pc = 0u;
    reference->instruction_active = true;
    if (reads_source) {
        left = dspic33_read_word(reference, address & 0xfffeu);
    }
    value = direct_file_result(operation, left, right, initial_status, false);
    status = direct_file_status(operation, left, right, initial_status, false);
    reference->sr = status;
    if (!file_destination && writes_result) {
        write_direct_file_reference_result(reference, value, false);
    }
    reference->instruction_active = false;
    reference->previous_working_register_writes =
        reference->instruction_working_register_writes;
    reference->current_instruction_cycles = 0u;
    reference->non_cpu_sfr_read = false;
    reference->psv_read = false;
    reference->psv_repeat_optimized = false;
    reference->instruction_advancing = true;
    if (non_cpu_sfr) {
        dspic33_device_advance_instruction(reference, 1u, device_ratio);
        dspic33_device_advance_instruction(reference, 1u, device_ratio);
    } else {
        dspic33_device_advance_instruction(reference, 1u, device_ratio);
    }
    reference->instruction_advancing = false;
    matches =
        dspic33_load_program_word(cpu, 0u, opcode) &&
        dspic33_step(cpu) == DSPIC33_TRAPPED && cpu->last_trap == 1u &&
        cpu->last_trap_return == 2u && cpu->pc == 0x000340u &&
        cpu->cycles == expected_cycles && cpu->w[15] == 0x5004u &&
        (dspic33_read_word(cpu, 0x08c0u) & 0x0008u) != 0u &&
        (dspic33_read_word(cpu, 0x5002u) >> 8u) == (status & 0x00ffu) &&
        (uint16_t)(cpu->data[0x08c8u] | ((uint16_t)cpu->data[0x08c9u] << 8u)) ==
            0x0e01u &&
        memcmp(cpu->w, reference->w, 15u * sizeof(*cpu->w)) == 0 &&
        memcmp(cpu->data, reference->data, 0x08c0u) == 0 &&
        memcmp(cpu->data + 0x08c2u, reference->data + 0x08c2u, 0x08c8u - 0x08c2u) ==
            0 &&
        memcmp(cpu->data + 0x08cau, reference->data + 0x08cau, 0x2000u - 0x08cau) ==
            0 &&
        memcmp(&cpu->nvm, &reference->nvm, sizeof(cpu->nvm)) == 0 &&
        memcmp(&cpu->oscillator, &reference->oscillator, sizeof(cpu->oscillator)) ==
            0 &&
        memcmp(&cpu->watchdog, &reference->watchdog, sizeof(cpu->watchdog)) == 0 &&
        direct_file_io_states_match(cpu, reference) &&
        direct_file_event_queues_match(cpu, reference);

    if (file_destination || !writes_result) {
        matches = matches && cpu->w[0] == right;
    } else {
        matches = matches && cpu->w[0] == value;
    }
    return matches;
}

static bool load_direct_file_trap_vectors(Dspic33* cpu) {
    static const uint32_t vectors[] = {0x000004u, 0x000006u, 0x000008u,
                                       0x00000au, 0x00000eu, 0x000010u};
    size_t index;

