tylertms/dspic33e-sim/conformance/processor.c
    for (index = 0u; index < sizeof(vectors) / sizeof(*vectors); index++) {
        if (!dspic33_load_program_word(cpu, vectors[index], 0x000340u)) {
            return false;
        }
    }
    return true;
}

static bool direct_file_flag_outcomes_complete(const bool observed[512],
                                               DirectFileOperation operation,
                                               bool byte_mode) {
    bool expected[512] = {false};
    uint32_t maximum = byte_mode ? UINT8_MAX : UINT16_MAX;
    uint32_t value;
    uint16_t status;

    for (value = 0u; value <= maximum; value++) {
        uint8_t initial;
        for (initial = 0u; initial < 4u; initial++) {
            if (operation >= DIRECT_FILE_AND && operation <= DIRECT_FILE_IOR) {
                status = direct_file_logic_status(initial, (uint16_t)value, byte_mode);
            } else {
                status = direct_file_status(operation, (uint16_t)value, 0u, initial,
                                            byte_mode);
            }
            expected[status & 0x01ffu] = true;
        }
    }
    for (status = 0u; status < 512u; status++) {
        if (expected[status] != observed[status]) {
            return false;
        }
    }
    return true;
}

static bool run_direct_file_case(Dspic33* actual, Dspic33* reference, uint32_t opcode,
                                 DirectFileOperation operation, uint16_t address,
                                 bool byte_mode, bool file_destination) {
    bool matches;

    prepare_direct_file_case(actual, address, byte_mode);
    prepare_direct_file_case(reference, address, byte_mode);
    if (!byte_mode && (address & 1u) != 0u &&
        (direct_file_reads_source(operation) || file_destination)) {
        return run_direct_file_odd_word_case(actual, reference, opcode, operation,
                                             address, file_destination);
    }
    matches = dspic33_load_program_word(actual, 0u, opcode) &&
              dspic33_load_program_word(reference, 0u, opcode);
    dspic33_step(actual);
    run_direct_file_reference(reference, operation, address, byte_mode,
                              file_destination);
    return matches && (file_destination && address >= 0x08c0u && address <= 0x08c7u
                           ? direct_file_trap_register_state_matches(actual, reference)
                           : direct_file_states_match(actual, reference));
}

static void direct_file_arithmetic_encoding_matrix_cases(ProcessorConformance* state) {
    static const uint32_t bases[6] = {0xbd0000u, 0xbd8000u, 0xb40000u,
                                      0xb48000u, 0xb50000u, 0xb58000u};
    static Dspic33 actual;
    static Dspic33 reference;
    uint32_t cases = 0u;
    bool actual_initialized = dspic33_initialize(&actual);
    bool reference_initialized = dspic33_initialize(&reference);
    uint8_t operation;

    expect(state, actual_initialized && reference_initialized,
           "initialize direct-file arithmetic processors");
    if (!actual_initialized || !reference_initialized) {
        if (actual_initialized) {
            dspic33_destroy(&actual);
        }
        if (reference_initialized) {
            dspic33_destroy(&reference);
        }
        return;
    }
    expect(state,
           load_direct_file_trap_vectors(&actual) &&
               load_direct_file_trap_vectors(&reference),
           "load direct-file arithmetic address-error vectors");
    for (operation = 0u; operation < 6u; operation++) {
        uint8_t byte_mode;
        for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
            uint8_t file_destination;
            for (file_destination = 0u; file_destination < 2u; file_destination++) {
                uint16_t address;
                for (address = 0u; address < 0x2000u; address++) {
                    uint32_t opcode = bases[operation] | ((uint32_t)byte_mode << 14u) |
                                      ((uint32_t)file_destination << 13u) | address;
                    bool matches = run_direct_file_case(
                        &actual, &reference, opcode, (DirectFileOperation)operation,
                        address, byte_mode != 0u, file_destination != 0u);
                    expect_dsp_matrix_case(state, matches, opcode,
                                           "direct-file arithmetic encoding");
                    cases++;
                }
            }
        }
    }
    expect(state, cases == 196608u,
           "direct-file arithmetic encoding matrix is exhaustive");
    dspic33_destroy(&actual);
    dspic33_destroy(&reference);
}

static void direct_file_logical_encoding_matrix_cases(ProcessorConformance* state,
                                                      Dspic33* invalid_cpu) {
    static const uint32_t bases[3] = {0xb60000u, 0xb68000u, 0xb70000u};
    static const DirectFileOperation operations[3] = {DIRECT_FILE_AND, DIRECT_FILE_XOR,
                                                      DIRECT_FILE_IOR};
    static Dspic33 actual;
    static Dspic33 reference;
    bool flag_outcomes[3][2][512] = {{{false}}};
    uint32_t valid = 0u;
    uint32_t invalid = 0u;
    bool actual_initialized = dspic33_initialize(&actual);
    bool reference_initialized = dspic33_initialize(&reference);
    uint8_t operation;

    expect(state, actual_initialized && reference_initialized,
           "initialize direct-file logical processors");
    if (!actual_initialized || !reference_initialized) {
        if (actual_initialized) {
            dspic33_destroy(&actual);
        }
        if (reference_initialized) {
            dspic33_destroy(&reference);
        }
        return;
    }
    expect(state,
           load_direct_file_trap_vectors(&actual) &&
               load_direct_file_trap_vectors(&reference),
           "load direct-file logical address-error vectors");
    for (operation = 0u; operation < 3u; operation++) {
        uint8_t byte_mode;
        for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
            uint8_t file_destination;
            for (file_destination = 0u; file_destination < 2u; file_destination++) {
                uint16_t address;
                for (address = 0u; address < 0x2000u; address++) {
                    uint32_t opcode = bases[operation] | ((uint32_t)byte_mode << 14u) |
                                      ((uint32_t)file_destination << 13u) | address;
                    bool matches = run_direct_file_case(
                        &actual, &reference, opcode, operations[operation], address,
                        byte_mode != 0u, file_destination != 0u);

                    if (address >= 0x1000u) {
                        flag_outcomes[operation][byte_mode][reference.sr & 0x01ffu] =
                            true;
                    }
                    expect_dsp_matrix_case(state, matches, opcode,
                                           "direct-file logical encoding");
                    valid++;
                }
            }
        }
    }
    for (uint8_t byte_mode = 0u; byte_mode < 2u; byte_mode++) {
        for (uint16_t address = 0u; address < 0x2000u; address++) {
            run_invalid_binary_matrix_case(
                state, invalid_cpu, 0xb78000u | ((uint32_t)byte_mode << 14u) | address);
            invalid++;
        }
    }
    expect(state, valid == 98304u,
           "direct-file logical valid encoding matrix is exhaustive");
    expect(state, invalid == 16384u,
           "direct-file logical illegal encoding matrix is exhaustive");
    for (operation = 0u; operation < 3u; operation++) {
        uint8_t byte_mode;
        for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
            expect(state,
                   direct_file_flag_outcomes_complete(
                       flag_outcomes[operation][byte_mode], operations[operation],
                       byte_mode != 0u),
                   "direct-file logical flag outcomes are exhaustive");
        }
    }
    dspic33_destroy(&actual);
    dspic33_destroy(&reference);
}

