tylertms/dspic33e-sim/conformance/processor.c
static void direct_file_unary_encoding_matrix_cases(ProcessorConformance* state) {
    static const uint32_t bases[8] = {0xec0000u, 0xec8000u, 0xed0000u, 0xed8000u,
                                      0xee0000u, 0xee8000u, 0xef0000u, 0xef8000u};
    static const DirectFileOperation operations[8] = {
        DIRECT_FILE_INC, DIRECT_FILE_INC2, DIRECT_FILE_DEC, DIRECT_FILE_DEC2,
        DIRECT_FILE_NEG, DIRECT_FILE_COM,  DIRECT_FILE_CLR, DIRECT_FILE_SETM};
    static Dspic33 actual;
    static Dspic33 reference;
    bool flag_outcomes[8][2][512] = {{{false}}};
    uint32_t cases = 0u;
    bool actual_initialized = dspic33_initialize(&actual);
    bool reference_initialized = dspic33_initialize(&reference);
    uint8_t operation;

    expect(state, actual_initialized && reference_initialized,
           "initialize direct-file unary processors");
    if (!actual_initialized || !reference_initialized) {
        if (actual_initialized) {
            dspic33_destroy(&actual);
        }
        if (reference_initialized) {
            dspic33_destroy(&reference);
        }
        return;
    }
    expect(state,
           load_direct_file_trap_vectors(&actual) &&
               load_direct_file_trap_vectors(&reference),
           "load direct-file unary address-error vectors");
    for (operation = 0u; operation < 8u; operation++) {
        uint8_t byte_mode;
        for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
            uint8_t file_destination;
            for (file_destination = 0u; file_destination < 2u; file_destination++) {
                uint16_t address;
                for (address = 0u; address < 0x2000u; address++) {
                    uint32_t opcode = bases[operation] | ((uint32_t)byte_mode << 14u) |
                                      ((uint32_t)file_destination << 13u) | address;
                    bool matches = run_direct_file_case(
                        &actual, &reference, opcode, operations[operation], address,
                        byte_mode != 0u, file_destination != 0u);

                    if (address >= 0x1000u) {
                        flag_outcomes[operation][byte_mode][reference.sr & 0x01ffu] =
                            true;
                    }
                    expect_dsp_matrix_case(state, matches, opcode,
                                           "direct-file unary encoding");
                    cases++;
                }
            }
        }
    }
    expect(state, cases == 262144u, "direct-file unary encoding matrix is exhaustive");
    for (operation = 0u; operation < 8u; operation++) {
        uint8_t byte_mode;
        for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
            expect(state,
                   direct_file_flag_outcomes_complete(
                       flag_outcomes[operation][byte_mode], operations[operation],
                       byte_mode != 0u),
                   "direct-file unary flag outcomes are exhaustive");
        }
    }
    dspic33_destroy(&actual);
    dspic33_destroy(&reference);
}

static void run_legal_compare_register_case(ProcessorConformance* state, Dspic33* cpu,
                                            uint32_t opcode) {
    bool compare_zero = (opcode & 0xff0000u) == 0xe00000u;
    bool with_borrow = !compare_zero && (opcode & 0x008000u) != 0u;
    bool byte_mode = (opcode & 0x000400u) != 0u;
    uint8_t width = byte_mode ? 1u : 2u;
    uint8_t source_mode = (uint8_t)((opcode >> 4u) & 0x07u);
    uint8_t source_register = (uint8_t)(opcode & 0x0fu);
    uint8_t base_register = (uint8_t)((opcode >> 11u) & 0x0fu);
    bool literal = !compare_zero && source_mode >= 6u;
    uint16_t initial_status =
        (uint16_t)((opcode & 1u) | (((opcode >> 7u) & 1u) << 1u) |
                   (((opcode >> 8u) & 1u) << 2u) | (((opcode >> 9u) & 1u) << 3u) |
                   (((opcode >> 10u) & 1u) << 8u));
    uint16_t registers[16];
    BinaryMatrixOperand source = {0u, true};
    uint16_t source_value = byte_mode ? (uint16_t)(0x0080u | (opcode & 0x007fu))
                                      : (uint16_t)(0x8000u | (opcode & 0x03ffu));
    uint16_t left;
    uint16_t right;
    uint16_t expected_status;
    uint64_t cycles;
    bool matches;

    prepare_arithmetic_matrix_case(cpu, registers, initial_status);
    left = compare_zero ? 0u
                        : (byte_mode ? (uint8_t)registers[base_register]
                                     : registers[base_register]);
    if (literal) {
        right = (uint16_t)(((opcode >> 2u) & 0x00e0u) | (opcode & 0x001fu));
    } else {
        source = binary_matrix_operand(registers, source_mode, source_register, width);
        right = source.direct ? (byte_mode ? (uint8_t)registers[source_register]
                                           : registers[source_register])
                              : source_value;
    }
    if (compare_zero) {
        left = right;
        right = 0u;
    }
    if (!literal && !source.direct) {
        if (byte_mode) {
            dspic33_write_byte(cpu, source.address, (uint8_t)source_value);
        } else {
            dspic33_write_word(cpu, source.address, source_value);
        }
    }
    expected_status = binary_matrix_status(with_borrow ? ARITHMETIC_MATRIX_SUBB
                                                       : ARITHMETIC_MATRIX_SUB,
                                           left, right, initial_status, byte_mode);
    cycles = cpu->cycles;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
              cpu->cycles - cycles == 1u && cpu->sr == expected_status &&
              cpu->corcon == 0x0020u && cpu->unsupported_opcode == 0u &&
              !cpu->address_error && !cpu->illegal_reset &&
              cpu->last_trap == UINT16_MAX &&
              binary_matrix_registers_match(cpu, registers);
    if (!literal && !source.direct) {
        matches =
            matches &&
            (byte_mode ? dspic33_read_byte(cpu, source.address) == (uint8_t)source_value
                       : dspic33_read_word(cpu, source.address) == source_value);
    }
    expect_dsp_matrix_case(state, matches, opcode, "legal compare encoding");
}

static void compare_register_encoding_matrix_cases(ProcessorConformance* state,
                                                   Dspic33* cpu) {
    uint32_t legal = 0u;
    uint32_t invalid = 0u;
    uint32_t opcode;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (opcode = 0xe00000u; opcode < 0xe20000u; opcode++) {
        uint8_t source_mode = (uint8_t)((opcode >> 4u) & 0x07u);
        bool compare_zero = (opcode & 0xff0000u) == 0xe00000u;
        bool valid = compare_zero ? (opcode & 0x00fb80u) == 0u && source_mode < 6u
                                  : source_mode >= 6u || (opcode & 0x000380u) == 0u;

