tylertms/dspic33e-sim/conformance/processor.c
    prepare_generic_multiply_case(cpu, source_mode, source_register, expected_w);
    source = source_mode >= 6u   ? (uint16_t)(opcode & 0x001fu)
             : source_mode == 0u ? expected_w[source_register]
                                 : generic_multiply_source_value(source_mode);
    if (source_mode == 2u || source_mode == 4u) {
        expected_w[source_register] = 0x5006u;
    } else if (source_mode == 3u || source_mode == 5u) {
        expected_w[source_register] = 0x500au;
    }
    product = generic_multiply_operand(expected_w[base_register], base_signed) *
              generic_multiply_operand(source, source_signed);
    if (destination >= 14u) {
        expected_accumulator[destination & 1u] = product;
    } else {
        uint8_t result_register = (uint8_t)(destination & 0x0eu);
        expected_w[result_register] = (uint16_t)product;
        if ((destination & 1u) == 0u) {
            expected_w[result_register + 1u] = (uint16_t)((uint32_t)product >> 16u);
        }
    }
    cycles = cpu->cycles;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
              cpu->cycles - cycles == 1u &&
              cpu->accumulator[0] == expected_accumulator[0] &&
              cpu->accumulator[1] == expected_accumulator[1] && cpu->sr == 0x010fu &&
              cpu->corcon == 0x0005u && !cpu->address_error && !cpu->illegal_reset &&
              cpu->unsupported_opcode == 0u && cpu->last_trap == UINT16_MAX;
    for (reg = 0u; reg < 16u; reg++) {
        matches = matches && cpu->w[reg] == expected_w[reg];
    }
    expect_dsp_matrix_case(state, matches, opcode, "legal generic multiply encoding");
}

static void generic_multiply_encoding_matrix_cases(ProcessorConformance* state,
                                                   Dspic33* cpu) {
    uint32_t legal_cases = 0u;
    uint32_t invalid_cases = 0u;
    uint8_t base_signed;
    uint8_t source_signed;
    uint8_t base_register;
    uint8_t destination;
    uint8_t source_mode;
    uint8_t source_register;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (base_signed = 0u; base_signed < 2u; base_signed++) {
        for (source_signed = 0u; source_signed < 2u; source_signed++) {
            for (base_register = 0u; base_register < 16u; base_register++) {
                for (destination = 0u; destination < 16u; destination++) {
                    for (source_mode = 0u; source_mode < 8u; source_mode++) {
                        for (source_register = 0u; source_register < 16u;
                             source_register++) {
                            uint32_t opcode =
                                0xb80000u | ((uint32_t)base_signed << 16u) |
                                ((uint32_t)source_signed << 15u) |
                                ((uint32_t)base_register << 11u) |
                                ((uint32_t)destination << 7u) |
                                ((uint32_t)source_mode << 4u) | source_register;
                            if (source_signed != 0u && source_mode >= 6u) {
                                run_invalid_dsp_matrix_case(state, cpu, opcode);
                                invalid_cases++;
                            } else {
                                run_legal_generic_multiply_case(
                                    state, cpu, opcode, base_signed != 0u,
                                    source_signed != 0u, base_register, destination,
                                    source_mode, source_register);
                                legal_cases++;
                            }
                        }
                    }
                }
            }
        }
    }
    expect(state, legal_cases == 114688u,
           "generic multiply legal encoding matrix is exhaustive");
    expect(state, invalid_cases == 16384u,
           "generic multiply illegal encoding matrix is exhaustive");
}

static void file_multiply_encoding_matrix_cases(ProcessorConformance* state,
                                                Dspic33* cpu) {
    uint32_t cases = 0u;
    uint8_t byte_mode;
    uint16_t address;

    expect(state, dspic33_load_program_word(cpu, 0x000006u, 0x000340u),
           "load file multiply address-error vector");
    for (byte_mode = 0u; byte_mode < 2u; byte_mode++) {
        for (address = 0u; address < 0x2000u; address++) {
            uint32_t opcode = 0xbc0000u | ((uint32_t)byte_mode << 14u) | address;
            bool matches;
            dspic33_reset(cpu, 0u);
            cpu->stop_on_trap = true;
            dspic33_set_working_register(cpu, 0u, 0u);
            dspic33_set_working_register(cpu, 2u, 0xa5a5u);
            dspic33_set_working_register(cpu, 3u, 0x5a5au);
            dspic33_set_working_register(cpu, 15u, 0x5000u);
            cpu->sr = 0x010fu;
            matches = dspic33_load_program_word(cpu, 0u, opcode);
            if (byte_mode == 0u && (address & 1u) != 0u) {
                matches = matches && dspic33_step(cpu) == DSPIC33_TRAPPED &&
                          cpu->last_trap == 1u && cpu->last_trap_return == 2u &&
                          cpu->pc == 0x000340u &&
                          (dspic33_read_word(cpu, 0x08c0u) & 0x0008u) != 0u;
            } else {
                matches = matches && dspic33_step(cpu) == DSPIC33_RUNNING &&
                          cpu->pc == 2u && cpu->w[2] == 0u &&
                          cpu->w[3] == (byte_mode != 0u ? 0x5a5au : 0u) &&
                          cpu->sr == 0x010fu && cpu->last_trap == UINT16_MAX &&
                          cpu->unsupported_opcode == 0u;
            }
            expect_dsp_matrix_case(state, matches, opcode, "file multiply encoding");
            cases++;
        }
    }
    expect(state, cases == 16384u, "file multiply encoding matrix is exhaustive");
}

static void prepare_move_matrix_case(Dspic33* cpu) {
    cpu->pc = 0u;
    cpu->sr = 0x010fu;
    cpu->corcon = 0x0005u;
    cpu->previous_working_register_writes = 0u;
    cpu->unsupported_opcode = 0u;
    cpu->last_trap = UINT16_MAX;
    cpu->last_interrupt = UINT16_MAX;
    cpu->address_error = false;
    cpu->illegal_reset = false;
    cpu->stop_reason = DSPIC33_RUNNING;
    cpu->instruction_active = false;
    cpu->repeat_active = 0u;
    cpu->do_depth = 0u;
    cpu->events.count = 0u;
}

static void run_invalid_move_matrix_case(ProcessorConformance* state, Dspic33* cpu,
                                         uint32_t opcode) {
    uint64_t illegal_resets;
    bool matches;
    uint8_t reg;

