tylertms/dspic33e-sim/conformance/processor.c
typedef struct {
    uint16_t address;
    bool direct;
} MoveMatrixOperand;

static MoveMatrixOperand resolve_move_matrix_operand(uint16_t registers[16],
                                                     uint8_t mode, uint8_t reg,
                                                     uint8_t offset_reg,
                                                     uint8_t width) {
    MoveMatrixOperand operand = {0u, mode == 0u};
    int32_t adjusted;
    if (mode == 0u) {
        return operand;
    }
    if (mode == 1u) {
        operand.address = registers[reg];
        return operand;
    }
    if (mode == 2u || mode == 3u) {
        operand.address = registers[reg];
        adjusted =
            (int32_t)registers[reg] + (mode == 3u ? (int32_t)width : -(int32_t)width);
        registers[reg] = reg == 15u ? (uint16_t)adjusted & 0xfffeu : (uint16_t)adjusted;
        return operand;
    }
    if (mode == 4u || mode == 5u) {
        adjusted =
            (int32_t)registers[reg] + (mode == 5u ? (int32_t)width : -(int32_t)width);
        operand.address = (uint16_t)adjusted;
        registers[reg] = reg == 15u ? (uint16_t)adjusted & 0xfffeu : (uint16_t)adjusted;
        return operand;
    }
    operand.address = (uint16_t)(registers[reg] + registers[offset_reg]);
    return operand;
}

static void prepare_move_registers(Dspic33* cpu, uint16_t expected[16], uint16_t base,
                                   uint16_t stride) {
    uint8_t reg;
    prepare_move_matrix_case(cpu);
    for (reg = 0u; reg < 16u; reg++) {
        uint16_t value = (uint16_t)(base + (uint16_t)reg * stride);
        dspic33_set_working_register(cpu, reg, value);
        expected[reg] = cpu->w[reg];
    }
}

static bool move_matrix_registers_match(const Dspic33* cpu,
                                        const uint16_t expected[16]) {
    uint8_t reg;
    for (reg = 0u; reg < 16u; reg++) {
        if (cpu->w[reg] != expected[reg]) {
            return false;
        }
    }
    return true;
}

static void generic_move_encoding_matrix_cases(ProcessorConformance* state,
                                               Dspic33* cpu) {
    uint32_t cases = 0u;
    uint32_t opcode;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (opcode = 0x780000u; opcode <= 0x7fffffu; opcode++) {
        uint8_t source_register = (uint8_t)(opcode & 0x0fu);
        uint8_t source_mode = (uint8_t)((opcode >> 4u) & 0x07u);
        uint8_t destination_register = (uint8_t)((opcode >> 7u) & 0x0fu);
        uint8_t destination_mode = (uint8_t)((opcode >> 11u) & 0x07u);
        uint8_t offset_register = (uint8_t)((opcode >> 15u) & 0x0fu);
        bool byte_mode = (opcode & 0x004000u) != 0u;
        uint8_t width = byte_mode ? 1u : 2u;
        uint16_t expected[16];
        MoveMatrixOperand source;
        MoveMatrixOperand destination;
        uint16_t value;
        uint64_t cycles;
        bool matches;

        prepare_move_registers(cpu, expected, 0x2000u, 2u);
        source = resolve_move_matrix_operand(expected, source_mode, source_register,
                                             offset_register, width);
        if (source.direct) {
            value = byte_mode ? (uint8_t)expected[source_register]
                              : expected[source_register];
        } else if (byte_mode) {
            dspic33_write_byte(cpu, source.address, 0xa5u);
            value = 0x00a5u;
        } else {
            dspic33_write_word(cpu, source.address, 0xa55au);
            value = 0xa55au;
        }
        destination = resolve_move_matrix_operand(
            expected, destination_mode, destination_register, offset_register, width);
        if (destination.direct) {
            if (byte_mode) {
                expected[destination_register] =
                    (uint16_t)((expected[destination_register] & 0xff00u) | value);
            } else {
                expected[destination_register] = value;
            }
            if (destination_register == 15u) {
                expected[destination_register] &= 0xfffeu;
            }
        }
        cycles = cpu->cycles;
        matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                  dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
                  cpu->cycles - cycles == 1u && cpu->sr == 0x010fu &&
                  cpu->unsupported_opcode == 0u && !cpu->illegal_reset &&
                  cpu->last_trap == UINT16_MAX &&
                  move_matrix_registers_match(cpu, expected);
        if (!destination.direct) {
            matches =
                matches &&
                (byte_mode ? dspic33_read_byte(cpu, destination.address) == value
                           : dspic33_read_word(cpu, destination.address) == value);
        }
        expect_dsp_matrix_case(state, matches, opcode, "generic MOV encoding");
        cases++;
    }
    expect(state, cases == 524288u, "generic MOV encoding matrix is exhaustive");
}

static int16_t move_offset_literal(uint32_t opcode, bool byte_mode) {
    uint16_t encoded =
        (uint16_t)((((opcode >> 15u) & 0x0fu) << 6u) |
                   (((opcode >> 11u) & 0x07u) << 3u) | ((opcode >> 4u) & 0x07u));
    int16_t offset = (int16_t)(encoded | ((encoded & 0x0200u) != 0u ? 0xfc00u : 0u));
    return byte_mode ? offset : (int16_t)(offset * 2);
}

static void offset_move_encoding_matrix_cases(ProcessorConformance* state,
                                              Dspic33* cpu) {
    uint32_t cases = 0u;
    uint32_t opcode;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (opcode = 0x900000u; opcode <= 0x9fffffu; opcode++) {
        uint8_t source = (uint8_t)(opcode & 0x0fu);
        uint8_t destination = (uint8_t)((opcode >> 7u) & 0x0fu);
        bool byte_mode = (opcode & 0x004000u) != 0u;
        bool store = (opcode & 0x080000u) != 0u;
        int16_t offset = move_offset_literal(opcode, byte_mode);
        uint16_t expected[16];
        uint16_t address;
        uint16_t value;
        uint64_t cycles;
        bool matches;

        prepare_move_registers(cpu, expected, 0x4000u, 2u);
        if (store) {
            address = (uint16_t)(expected[destination] + offset);
            value = byte_mode ? (uint8_t)expected[source] : expected[source];
        } else {
            address = (uint16_t)(expected[source] + offset);
            value = byte_mode ? 0x00a5u : 0xa55au;
            if (byte_mode) {
                dspic33_write_byte(cpu, address, (uint8_t)value);
                expected[destination] =
                    (uint16_t)((expected[destination] & 0xff00u) | value);
            } else {
                dspic33_write_word(cpu, address, value);
                expected[destination] = value;
            }
            if (destination == 15u) {
                expected[destination] &= 0xfffeu;
            }
        }
        cycles = cpu->cycles;
        matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                  dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
                  cpu->cycles - cycles == 1u && cpu->sr == 0x010fu &&
                  cpu->unsupported_opcode == 0u && !cpu->illegal_reset &&
                  cpu->last_trap == UINT16_MAX &&
                  move_matrix_registers_match(cpu, expected);
        if (store) {
            matches = matches && (byte_mode ? dspic33_read_byte(cpu, address) == value
                                            : dspic33_read_word(cpu, address) == value);
        }
        expect_dsp_matrix_case(state, matches, opcode, "offset MOV encoding");
        cases++;
    }
    expect(state, cases == 1048576u, "offset MOV encoding matrix is exhaustive");
}

static void move_double_encoding_matrix_cases(ProcessorConformance* state,
                                              Dspic33* cpu) {
    uint32_t legal_loads = 0u;
    uint32_t legal_stores = 0u;
    uint32_t invalid = 0u;
    uint32_t opcode;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (opcode = 0xbe0000u; opcode <= 0xbeffffu; opcode++) {
        uint8_t source_mode = (uint8_t)((opcode >> 4u) & 0x07u);
        uint8_t source_register = (uint8_t)(opcode & 0x0fu);
        uint8_t destination_mode = (uint8_t)((opcode >> 11u) & 0x07u);
        uint8_t destination_register = (uint8_t)((opcode >> 7u) & 0x0fu);
        bool load = (opcode & 0xfff880u) == 0xbe0000u && source_mode <= 5u &&
                    (source_mode != 0u || (source_register & 1u) == 0u);
        bool store = (opcode & 0xffc071u) == 0xbe8000u && destination_mode >= 1u &&
                     destination_mode <= 5u;
        if (!load && !store) {
            run_invalid_move_matrix_case(state, cpu, opcode);
            invalid++;
            continue;
        }
        uint16_t expected[16];
        MoveMatrixOperand source;
        MoveMatrixOperand destination;
        uint16_t low;
        uint16_t high;
        uint64_t cycles;
        bool matches;

